[
  {
    "url_id": "disneyland-park-anaheim",
    "name": "Disneyland Park",
    "resort": "Disneyland Resort",
    "city": "Anaheim",
    "state_region": "California",
    "country": "United States",
    "opening_date": "1955-07-17",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 100,
    "theme": "Classic Disney stories, fantasy lands and adventures brought to life around Sleeping Beauty Castle.",
    "short_description": "The original Disney theme park, where classic attractions, characters and storytelling began.",
    "long_description": "Opened in 1955, Disneyland Park in Anaheim is the first Disney theme park ever built. It features iconic lands such as Main Street, U.S.A., Fantasyland, Adventureland, Tomorrowland and more, all centered around Sleeping Beauty Castle. The park blends nostalgia, classic attractions and new experiences as the spiritual home of Disney parks.",
    "official_website": "https://disneyland.disney.go.com/destinations/disneyland/",
    "image_1": "disneyland-park-anaheim"
  },
  {
    "url_id": "disney-california-adventure",
    "name": "Disney California Adventure Park",
    "resort": "Disneyland Resort",
    "city": "Anaheim",
    "state_region": "California",
    "country": "United States",
    "opening_date": "2001-02-08",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 55,
    "theme": "Celebration of California’s landscapes, stories and pop culture with Pixar and Marvel experiences.",
    "short_description": "A cinematic, California-themed park featuring Pixar and Marvel lands next to Disneyland Park.",
    "long_description": "Disney California Adventure Park opened in 2001 and reimagines California through Disney storytelling. Guests can explore areas like Pixar Pier, Avengers Campus, Grizzly Peak and Cars Land, combining thrill rides, nighttime spectaculars and character-driven experiences inspired by Disney, Pixar and Marvel films.",
    "official_website": "https://disneyland.disney.go.com/destinations/disney-california-adventure/",
    "image_1": "disney-california-adventure"
  },
  {
    "url_id": "magic-kingdom",
    "name": "Magic Kingdom Park",
    "resort": "Walt Disney World Resort",
    "city": "Bay Lake (near Orlando)",
    "state_region": "Florida",
    "country": "United States",
    "opening_date": "1971-10-01",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 142,
    "theme": "Fairy tales and classic Disney adventures around Cinderella Castle.",
    "short_description": "Walt Disney World’s flagship castle park, centered on Cinderella Castle and classic Disney lands.",
    "long_description": "Magic Kingdom opened in 1971 as the first theme park at Walt Disney World. It is organized around Cinderella Castle and six themed lands, including Main Street, U.S.A., Adventureland, Frontierland, Liberty Square, Fantasyland and Tomorrowland. The park focuses on classic Disney characters, family attractions and iconic nighttime spectaculars.",
    "official_website": "https://disneyworld.disney.go.com/destinations/magic-kingdom/",
    "image_1": "magic-kingdom"
  },
  {
    "url_id": "epcot",
    "name": "EPCOT",
    "resort": "Walt Disney World Resort",
    "city": "Bay Lake (near Orlando)",
    "state_region": "Florida",
    "country": "United States",
    "opening_date": "1982-10-01",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 300,
    "theme": "Human achievement, innovation, world cultures and exploration of land, sea and space.",
    "short_description": "A park celebrating technology, imagination and world cultures, anchored by Spaceship Earth.",
    "long_description": "EPCOT opened in 1982 as a park inspired by ideas of progress and global community. It combines pavilions focused on imagination, nature and technology with the World Showcase, which highlights cultures and cuisines from around the globe. Seasonal festivals, nighttime spectaculars and educational attractions define the EPCOT experience.",
    "official_website": "https://disneyworld.disney.go.com/destinations/epcot/",
    "image_1": "epcot"
  },
  {
    "url_id": "disneys-hollywood-studios",
    "name": "Disney's Hollywood Studios",
    "resort": "Walt Disney World Resort",
    "city": "Bay Lake (near Orlando)",
    "state_region": "Florida",
    "country": "United States",
    "opening_date": "1989-05-01",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 135,
    "theme": "Hollywood, movies, television and immersive worlds like Star Wars and Toy Story.",
    "short_description": "A film- and TV-inspired park featuring Star Wars: Galaxy’s Edge, Toy Story Land and more.",
    "long_description": "Disney's Hollywood Studios opened in 1989 as a movie-themed park celebrating Hollywood storytelling. Over time it has evolved into a collection of large immersive lands, including Star Wars: Galaxy’s Edge and Toy Story Land, plus attractions inspired by Pixar, classic Hollywood and music. The park blends behind-the-scenes tributes with blockbuster IP experiences.",
    "official_website": "https://disneyworld.disney.go.com/destinations/hollywood-studios/",
    "image_1": "disneys-hollywood-studios"
  },
  {
    "url_id": "disneys-animal-kingdom",
    "name": "Disney's Animal Kingdom",
    "resort": "Walt Disney World Resort",
    "city": "Bay Lake (near Orlando)",
    "state_region": "Florida",
    "country": "United States",
    "opening_date": "1998-04-22",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 580,
    "theme": "Animals, nature and conservation, blending real wildlife with themed lands and attractions.",
    "short_description": "A massive zoological theme park where live animals, themed lands and conservation stories intersect.",
    "long_description": "Disney’s Animal Kingdom opened on Earth Day 1998 and is the largest Disney theme park by acreage. It centers on animal conservation and immersive lands such as Pandora – The World of Avatar, Africa and Asia. Guests encounter real animals on safaris and trails while also experiencing story-driven attractions and shows tied to nature-focused IP.",
    "official_website": "https://disneyworld.disney.go.com/destinations/animal-kingdom/",
    "image_1": "disneys-animal-kingdom"
  },
  {
    "url_id": "tokyo-disneyland",
    "name": "Tokyo Disneyland",
    "resort": "Tokyo Disney Resort",
    "city": "Urayasu",
    "state_region": "Chiba Prefecture",
    "country": "Japan",
    "opening_date": "1983-04-15",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 115,
    "theme": "A castle park inspired by Disneyland and Magic Kingdom, adapted for Japanese guests.",
    "short_description": "A classic castle park at Tokyo Disney Resort, featuring seven themed lands around Cinderella Castle.",
    "long_description": "Tokyo Disneyland opened in 1983 as the first Disney theme park outside the United States. Modeled after Disneyland and Magic Kingdom, it features seven themed lands such as World Bazaar, Fantasyland, Tomorrowland and Adventureland, built around Cinderella Castle. The park blends familiar attractions with local entertainment and seasonal events tailored to Japanese audiences.",
    "official_website": "https://www.tokyodisneyresort.jp/en/tdl.html",
    "image_1": "tokyo-disneyland"
  },
  {
    "url_id": "tokyo-disneysea",
    "name": "Tokyo DisneySea",
    "resort": "Tokyo Disney Resort",
    "city": "Urayasu",
    "state_region": "Chiba Prefecture",
    "country": "Japan",
    "opening_date": "2001-09-04",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 176,
    "theme": "Myths, legends and adventures of the sea, expressed through richly detailed ports of call.",
    "short_description": "A uniquely ocean-themed Disney park with elaborate ports inspired by exploration and fantasy.",
    "long_description": "Tokyo DisneySea opened in 2001 and is themed to the stories, myths and romance of the sea. The park is divided into highly detailed ports such as Mediterranean Harbor, Mysterious Island, Arabian Coast and American Waterfront. Known for its immersive design and original attractions, it is often regarded as one of Disney’s most ambitious parks.",
    "official_website": "https://www.tokyodisneyresort.jp/en/tds.html",
    "image_1": "tokyo-disneysea"
  },
  {
    "url_id": "disneyland-park-paris",
    "name": "Disneyland Park (Paris)",
    "resort": "Disneyland Paris",
    "city": "Chessy / Marne-la-Vallée",
    "state_region": "Île-de-France",
    "country": "France",
    "opening_date": "1992-04-12",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 140,
    "theme": "A European take on the classic castle park, with richly detailed lands and Sleeping Beauty Castle.",
    "short_description": "The flagship Disney park in Europe, reimagining the castle-park formula with French and European influences.",
    "long_description": "Disneyland Park at Disneyland Paris opened in 1992 as Europe’s primary Disney castle park. It features Sleeping Beauty Castle and lands such as Main Street, U.S.A., Frontierland, Adventureland, Fantasyland and Discoveryland. The park is known for its ornate architecture, seasonal festivals and integration of European design sensibilities into classic Disney storytelling.",
    "official_website": "https://www.disneylandparis.com/en-int/destinations/disneyland-park",
    "image_1": "disneyland-park-paris"
  },
  {
    "url_id": "walt-disney-studios-park",
    "name": "Walt Disney Studios Park",
    "resort": "Disneyland Paris",
    "city": "Chessy / Marne-la-Vallée",
    "state_region": "Île-de-France",
    "country": "France",
    "opening_date": "2002-03-16",
    "park_type": "Theme park",
    "is_castle_park": false,
    "area_acres": 67,
    "theme": "Movie and animation-inspired lands featuring Pixar and other Disney storytelling worlds.",
    "short_description": "A film-themed park at Disneyland Paris that is being transformed with new immersive lands.",
    "long_description": "Walt Disney Studios Park opened in 2002 as a companion to Disneyland Park, focusing on filmmaking and animation. Over time it has added immersive areas like Worlds of Pixar and continues to undergo a large transformation, including new lands such as World of Frozen and a future retheme to Disney Adventure World. It emphasizes modern franchises and cinematic experiences.",
    "official_website": "https://www.disneylandparis.com/en-int/destinations/walt-disney-studios-park",
    "image_1": "walt-disney-studios-park"
  },
  {
    "url_id": "hong-kong-disneyland",
    "name": "Hong Kong Disneyland",
    "resort": "Hong Kong Disneyland Resort",
    "city": "Penny's Bay, Lantau Island",
    "state_region": "Hong Kong",
    "country": "China",
    "opening_date": "2005-09-12",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 123,
    "theme": "A compact castle park blending classic Disney lands with unique areas and Chinese cultural influences.",
    "short_description": "A Disney castle park on Lantau Island featuring classic lands and newer areas like World of Frozen.",
    "long_description": "Hong Kong Disneyland opened in 2005 on Lantau Island as part of the Hong Kong Disneyland Resort. It offers lands such as Main Street, U.S.A., Fantasyland, Adventureland and Tomorrowland, along with unique additions like Mystic Point and the World of Frozen. The park incorporates local cultural considerations and continues to expand with new Marvel and Pixar experiences.",
    "official_website": "https://www.hongkongdisneyland.com/",
    "image_1": "hong-kong-disneyland"
  },
  {
    "url_id": "shanghai-disneyland",
    "name": "Shanghai Disneyland",
    "resort": "Shanghai Disney Resort",
    "city": "Pudong, Shanghai",
    "state_region": "Shanghai",
    "country": "China",
    "opening_date": "2016-06-16",
    "park_type": "Theme park",
    "is_castle_park": true,
    "area_acres": 225,
    "theme": "Classic Disney worlds reimagined with Chinese influences, anchored by Enchanted Storybook Castle.",
    "short_description": "A modern Disney castle park in mainland China with large immersive lands and the Enchanted Storybook Castle.",
    "long_description": "Shanghai Disneyland opened in 2016 as the first Disney theme park in mainland China. It features the Enchanted Storybook Castle—the tallest Disney castle—as well as lands like Gardens of Imagination, Fantasyland, Treasure Cove and Tomorrowland. The park blends familiar Disney characters with design choices and experiences tailored specifically to Chinese guests.",
    "official_website": "https://www.shanghaidisneyresort.com/",
    "image_1": "shanghai-disneyland"
  }
]
