[
  {
    "id": 1,
    "url_id": "aladdin",
    "name": "Aladdin",
    "short_description": "A street-smart thief from Agrabah who discovers a magical lamp containing a genie, leading him on an adventure to win the heart of Princess Jasmine and become a prince.",
    "long_description": "Aladdin is a kind-hearted street urchin and thief living in the bustling city of Agrabah. Orphaned at a young age, he survives by stealing food and trinkets with his monkey companion Abu. One day, while attempting to steal a loaf of bread, Aladdin is tricked by the evil sorcerer Jafar into entering a magical cave to retrieve a lamp. Inside the lamp lives Genie, a powerful spirit who grants Aladdin three wishes. Using his wishes wisely, Aladdin transforms from a street rat into a prince, wins the heart of Princess Jasmine, and ultimately defeats Jafar to become a true hero. Aladdin represents themes of self-discovery, courage, and the idea that one's worth is not determined by social status.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Aladdin",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_aladdin",
    "background_image_1": "s0_aladdin",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 2,
    "url_id": "alice",
    "name": "Alice",
    "short_description": "A curious young girl who follows a white rabbit down a rabbit hole into a fantastical world filled with peculiar characters and nonsensical adventures.",
    "long_description": "Alice is a seven-and-a-half-year-old English girl with a vivid imagination and insatiable curiosity. While sitting on a riverbank with her sister, she spots a White Rabbit wearing a waistcoat and pocket watch, muttering about being late. Following him down a rabbit hole, Alice enters Wonderland, a bizarre world where logic is turned upside down. She encounters the Mad Hatter, March Hare, Cheshire Cat, Queen of Hearts, and many other eccentric characters. Throughout her adventures, Alice learns about growing up, the importance of manners, and the value of staying true to oneself. Her story explores themes of childhood innocence, the absurdity of adult rules, and the journey from childhood to adulthood.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Alice in Wonderland",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_alice",
    "background_image_1": "s0_alice",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 3,
    "url_id": "angel",
    "name": "Angel",
    "short_description": "A charming and street-smart puppy who captures Scamp's heart in Lady and the Tramp II.",
    "long_description": "Angel is a feisty and independent puppy who once lived as a stray but dreams of finding a loving home. She meets Scamp, the rebellious son of Lady and Tramp, and helps him navigate the challenges of street life. Angel's past experiences make her wise beyond her years, and she ultimately helps Scamp realize the importance of family and belonging. Her character represents resilience, hope, and the desire for love and acceptance.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Lady and the Tramp",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_angel",
    "background_image_1": "s0_angel",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 4,
    "url_id": "animal",
    "name": "Animal",
    "short_description": "Animal is the wildly energetic, unpredictable drummer of Dr. Teeth and the Electric Mayhem. His personality is defined by pure, unrestrained passion.",
    "long_description": "Animal is the wildly energetic, unpredictable drummer of Dr. Teeth and the Electric Mayhem. His personality is defined by pure, unrestrained passion, especially when it comes to music. He plays the drums with a ferocity unmatched by any other Muppet, often teetering between artistic brilliance and complete chaos. His untamed hair, growling voice, and intense expressions make him instantly recognizable. Despite his frenzied behavior, Animal has moments that reveal a softer side. He often looks to others for guidance, especially when he's unsure of social norms or when his impulses take over. This childlike innocence makes him incredibly endearing. He isn't malicious—he simply experiences the world at a much higher volume than everyone else. Animal's simplicity in speech adds to his charm. His vocabulary may be short bursts of words like \"WOMAN!\" or \"DRUMS!\", but his emotions are loud and clear. Over the years, he has become a symbol of unfiltered creativity and passion—someone who reminds audiences that being different can be a powerful thing, especially if you channel it into something you love.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Muppets",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_animal",
    "background_image_1": "s0_animal",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 5,
    "url_id": "anna",
    "name": "Anna",
    "short_description": "The optimistic younger sister of Queen Elsa, whose adventurous spirit and determination help save Arendelle from eternal winter through an act of true love.",
    "long_description": "Anna is the younger sister of Queen Elsa and the princess of Arendelle. Energetic, optimistic, and a bit clumsy, Anna has spent most of her life isolated from her sister due to Elsa's powers. She dreams of adventure and connection, often feeling lonely after years of separation from Elsa. When Elsa accidentally unleashes an eternal winter on their kingdom, Anna embarks on a dangerous journey to find her sister and save Arendelle. Along the way, she meets Kristoff, Sven, and Olaf, forming strong friendships and discovering true love. Anna's selfless act of sacrificing herself to save Elsa breaks the curse, proving that the power of sisterly love can overcome any obstacle. Her character represents courage, optimism, and the importance of family bonds.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Frozen",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 6,
    "url_id": "ariel",
    "name": "Ariel",
    "short_description": "A spirited mermaid princess who dreams of life on land, collects human artifacts, and makes a deal with the sea witch Ursula to become human and pursue her love for Prince Eric.",
    "long_description": "Ariel is the youngest daughter of King Triton and the most rebellious of his seven daughters. Living in the underwater kingdom of Atlantica, Ariel has always been fascinated by the human world above the surface. She collects human artifacts in her secret grotto and dreams of walking on land and experiencing human life. Her curiosity leads her to save Prince Eric from drowning, and she falls deeply in love with him. Desperate to be with Eric, Ariel visits the sea witch Ursula, who offers to transform her into a human in exchange for her voice. Ariel must win Eric's love within three days or belong to Ursula forever. Through courage and the help of her friends, Ariel learns the value of family, friendship, and staying true to oneself while pursuing dreams.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Little Mermaid",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_ariel",
    "background_image_1": "s0_ariel",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 7,
    "url_id": "aurora",
    "name": "Aurora",
    "short_description": "A beautiful princess cursed to prick her finger on a spinning wheel and sleep for a century, awakened by true love's kiss from Prince Phillip.",
    "long_description": "Princess Aurora, also known as Briar Rose, is the daughter of King Stefan and Queen Leah. On her christening day, she is cursed by the evil fairy Maleficent to prick her finger on a spinning wheel and die before her 16th birthday. The good fairies Flora, Fauna, and Merryweather modify the curse so that she will only sleep until awakened by true love's kiss. Raised by the three fairies in a hidden cottage to protect her from Maleficent, Aurora grows up as a peasant girl named Briar Rose. On her 16th birthday, she meets Prince Phillip and they fall in love. Despite Maleficent's attempts to prevent it, Phillip's kiss awakens Aurora, breaking the curse and restoring peace to the kingdom. Aurora represents grace, kindness, and the power of true love.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sleeping Beauty",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_aurora",
    "background_image_1": "s0_aurora",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 8,
    "url_id": "bambi",
    "name": "Bambi",
    "short_description": "A young deer prince learning about life in the forest, facing the loss of his mother and discovering the circle of life through friendship and courage.",
    "long_description": "Bambi is a young deer who is destined to become the prince of the forest. Born to a loving mother and a majestic father (the Great Prince of the Forest), Bambi grows up learning the ways of the forest with his friends Thumper the rabbit and Flower the skunk. His idyllic childhood is shattered when hunters kill his mother, teaching him the harsh realities of life and death. Throughout his journey, Bambi learns about friendship, courage, and the natural cycle of life. He faces dangers from forest fires and human hunters, ultimately growing into a strong, wise leader. Bambi's story beautifully illustrates the innocence of childhood, the pain of loss, and the importance of respecting nature and all living creatures.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Bambi",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bambi",
    "background_image_1": "s0_bambi",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 9,
    "url_id": "baymax",
    "name": "Baymax",
    "short_description": "Baymax, from Big Hero 6, is an inflatable healthcare robot created by Tadashi Hamada. Designed to diagnose and treat injuries, pain, and emotional distress.",
    "long_description": "Baymax, from Big Hero 6, is an inflatable healthcare robot created by Tadashi Hamada. Designed to diagnose and treat injuries, pain, and emotional distress, Baymax embodies comfort, care, and compassion. His soft, pillowy exterior and gentle movements reinforce his role as a non-threatening medical companion. When he speaks, it's with calming, soothing intention. As Baymax bonds with Hiro, he evolves far beyond his initial programming. His understanding of compassion deepens, and he develops a loyalty that drives him to protect Hiro at all costs. Even though Baymax is a robot, his presence feels emotionally warm. His literal understanding of language often leads to humorous moments, but also to direct, honest communication. Baymax also represents healing from grief. After Hiro's loss of Tadashi, Baymax becomes a symbol of hope—someone who helps Hiro move through his pain, find purpose, and embrace connection again. His final act of sacrifice in the portal highlights how deeply he learns to value human life. Baymax is more than a robot; he is a heart wrapped in vinyl.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Big Hero 6",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_baymax",
    "background_image_1": "s0_baymax",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 10,
    "url_id": "beast",
    "name": "Beast",
    "short_description": "A prince transformed into a hideous beast by an enchantress's curse, learning compassion and love through his relationship with the kind-hearted Belle.",
    "long_description": "The Beast was once a selfish, spoiled prince living in a magnificent castle. When an enchantress disguised as an old woman seeks shelter from a storm and is turned away by the prince, she curses him, transforming him into a hideous beast and his servants into household objects. The curse can only be broken if he learns to love another and earns their love in return before the last petal falls from an enchanted rose. Initially gruff and temperamental, the Beast gradually changes through his relationship with Belle, who teaches him kindness, patience, and the meaning of true love. His transformation from monster to prince symbolizes personal growth, redemption, and the belief that beauty is found within, not in outward appearances.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_beast",
    "background_image_1": "s0_beast",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 11,
    "url_id": "belle",
    "name": "Belle",
    "short_description": "An intelligent book-loving girl who lives with her inventor father, Maurice. She sacrifices her freedom to save him from an enchanted prince cursed to live as a beast.",
    "long_description": "Belle is a kind, intelligent, and book-loving young woman living in a provincial town in France with her inventor father, Maurice. She is known for her love of reading and her desire for adventure beyond the confines of her small town. When her father gets lost and seeks shelter in a mysterious castle, he is imprisoned by the Beast, a prince cursed by an enchantress for his selfishness. Belle offers to take her father's place as prisoner, and over time, she and the Beast develop a deep friendship and eventually fall in love. Through Belle's compassion and the power of love, the curse is broken, transforming the Beast back into a prince. Belle represents intelligence, kindness, and the belief that true beauty comes from within, not from outward appearances.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_belle",
    "background_image_1": "s0_belle",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 12,
    "url_id": "ben",
    "name": "Ben",
    "short_description": "Ben appears across various Disney universes, but most commonly fans refer to Ben from Descendants, the son of Belle and the Beast.",
    "long_description": "Ben appears across various Disney universes, but most commonly fans refer to Ben from Descendants, the son of Belle and the Beast. As the prince—and eventually king—of Auradon, Ben is characterized by fairness, compassion, and a willingness to challenge old systems. Unlike previous rulers, he's open-minded and sees potential where others might see danger. His defining moment comes when he champions the idea of giving the children of villains a chance to attend Auradon Prep. This decision demonstrates his belief in redemption and individual choice. Ben refuses to judge people based on their parents' legacies, setting him apart as a leader who values progress over tradition. Ben's relationship with Mal challenges him emotionally and morally. He learns how to balance love and duty, heart and responsibility. Through him, Disney explores themes of leadership, forgiveness, and breaking cycles. Ben is a modern Disney prince—kind, thoughtful, and brave in quieter, deeper ways.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Descendants",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_ben",
    "background_image_1": "s0_ben",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 13,
    "url_id": "bingo",
    "name": "Bingo",
    "short_description": "Bingo is one of the lovable pug siblings from Puppy Dog Pals, known for his adventurous spirit and curious nature.",
    "long_description": "Bingo is one of the lovable pug siblings from Puppy Dog Pals, known for his adventurous spirit and curious nature. Along with his brother Rolly, Bingo travels the world on imaginative missions, exploring new places and solving problems along the way. His enthusiasm and optimism make every ordinary moment feel extraordinary. Bingo is often the more level-headed of the duo. While Rolly may dive headfirst into situations, Bingo thinks things through and keeps the mission on track. This dynamic creates a charming balance, showing kids the value of teamwork and complementary skills. Even when their adventures take wild turns, Bingo approaches each challenge with a problem-solving mindset. Beyond the excitement, Bingo is deeply loyal—to his brother, to Bob, and to their friends. His stories promote kindness, curiosity, and resilience. He may be small, but he has a big heart and a boundless sense of adventure.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Puppy Dog Pals",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bingo",
    "background_image_1": "s0_bingo",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 14,
    "url_id": "captain_hook",
    "name": "Captain Hook",
    "short_description": "The villainous pirate captain with a hook for a hand, obsessed with defeating Peter Pan and known for his fear of the crocodile that took his hand.",
    "long_description": "Captain Hook is the ruthless captain of the Jolly Roger and Peter Pan's arch-nemesis. Known for his hook hand (replaced after being bitten by a crocodile), Hook is a sophisticated but cowardly pirate who dresses in elaborate clothing and speaks with a refined accent. He leads a crew of pirates and is constantly trying to capture Peter Pan and the Lost Boys. Hook's greatest fear is the crocodile that swallowed a clock and follows him around, ticking ominously. Despite his villainous nature, Hook displays moments of humor and complexity. He represents the fear of aging and the loss of childhood innocence, serving as a foil to Peter Pan's eternal youth. Hook's character adds dramatic tension and excitement to the adventures in Neverland.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Peter Pan",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_hook",
    "background_image_1": "s0_captain_hook",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 15,
    "url_id": "captain_jack_sparrow",
    "name": "Captain Jack Sparrow",
    "short_description": "Captain Jack Sparrow is one of Disney's most iconic characters—a pirate of unpredictable genius, dramatic flair, and questionable sobriety.",
    "long_description": "Captain Jack Sparrow is one of Disney's most iconic characters—a pirate of unpredictable genius, dramatic flair, and questionable sobriety. His mannerisms, charm, and bizarre but effective strategies make him unforgettable. Jack shuffles through life claiming luck and improvisation, but he often proves to be far more clever than he lets on. One of Jack's greatest strengths is his ability to manipulate perception. He encourages enemies to underestimate him, using their assumptions to gain an advantage. His moral compass is unpredictable—sometimes heroic, sometimes self-serving—but always uniquely Jack. Despite his piracy, he holds to a personal code that occasionally surprises even him. Much of Jack's journey is about freedom—freedom from the law, from society, and from supernatural forces. His relationship with the Black Pearl symbolizes independence, identity, and legacy. Jack represents the idea that life is an adventure best lived boldly, with wit, humor, and just a touch of madness.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Pirates of the Caribbean",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_jack_sparrow",
    "background_image_1": "s0_captain_jack_sparrow",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 16,
    "url_id": "captain_jake",
    "name": "Captain Jake",
    "short_description": "Captain Jake, from Jake and the Never Land Pirates, is a brave and enthusiastic young pirate who leads his crew with courage and kindness.",
    "long_description": "Captain Jake, from Jake and the Never Land Pirates, is a brave and enthusiastic young pirate who leads his crew with courage and kindness. As he transitions from Jake to Captain Jake in later seasons, he grows into a more confident leader. He is known for his resourcefulness, teamwork, and commitment to doing what's right—even when facing off against Captain Hook. Jake teaches young viewers about friendship and responsibility. He encourages his crew—Izzy, Cubby, and Skully—to use their unique talents to solve problems. Together, they turn each challenge into an opportunity to learn and grow. Jake embodies positivity, fairness, and the joy of shared adventure. His upgraded role as captain comes with new responsibilities and adventures, but he continues to lead with the same genuine heart. Jake inspires young audiences to be brave, kind, and collaborative, showing that leadership isn't about being the strongest—it's about supporting others.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Jake and the Never Land Pirates",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_jake",
    "background_image_1": "s0_captain_jake",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 17,
    "url_id": "cheshire_cat",
    "name": "Cheshire Cat",
    "short_description": "The Cheshire Cat from Alice in Wonderland is a mysterious, whimsical, and mischievous figure who embodies the nonsensical nature of Wonderland.",
    "long_description": "The Cheshire Cat from Alice in Wonderland is a mysterious, whimsical, and mischievous figure who embodies the nonsensical nature of Wonderland. Known for his disappearing grin and cryptic advice, he acts as both guide and trickster. His logic is not rooted in the real world, making him unpredictable and fascinating. Despite his riddles, the Cheshire Cat often reveals truths hidden within Wonderland's chaos. His comments challenge Alice to think for herself rather than accept things at face value. His strange, philosophical remarks linger long after he vanishes into thin air. The Cheshire Cat represents curiosity, ambiguity, and the freedom to be entirely oneself. His playful unpredictability adds wonder to Alice's journey, reminding audiences that not all guidance comes in straightforward form—and that sometimes madness holds wisdom.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Alice in Wonderland",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_cheshire_cat",
    "background_image_1": "s0_cheshire_cat",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 18,
    "url_id": "chip_beauty_and_the_beast",
    "name": "Chip (Beauty and the Beast)",
    "short_description": "Chip is the sweet, playful young teacup from Beauty and the Beast, and one of the most lovable enchanted objects in the Beast's castle.",
    "long_description": "Chip is the sweet, playful young teacup from Beauty and the Beast, and one of the most lovable enchanted objects in the Beast's castle. As Mrs. Potts' son, he brings innocence and childlike curiosity to the story. Chip quickly forms a bond with Belle, showing kindness and friendliness that helps her feel welcome. Despite being small and fragile, Chip is brave. He plays a key role when Belle and Maurice need help, proving that courage doesn't depend on size. His determination and optimism bring warmth to even the Beast's gloomy castle. Chip's interactions often lighten tense moments, offering humor and heart. He reminds viewers that even in enchanted or difficult circumstances, hope and joy can shine through. His transformation back into a human child at the end is one of the most heartfelt moments in the film.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_chip_beauty_and_the_beast",
    "background_image_1": "s0_chip_beauty_and_the_beast",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 19,
    "url_id": "chip_n_dale",
    "name": "Chip 'n Dale",
    "short_description": "Chip 'n Dale are the mischievous chipmunk duo known for their endless antics and sibling-like banter.",
    "long_description": "Chip 'n Dale are the mischievous chipmunk duo known for their endless antics and sibling-like banter. Chip is the more serious, organized, and focused of the two, while Dale is goofy, carefree, and easily distracted. Together, they create comedic chaos that has entertained audiences for decades. Their adventures often revolve around stealing food, avoiding danger, or annoying characters like Donald Duck or Pluto. While they can be troublemakers, their teamwork and affection for each other are unmistakable. Their dynamic showcases the humor and challenges of close partnerships. Chip 'n Dale also star as detectives in Rescue Rangers, where their personalities shine even more. Their blend of comedy, problem-solving, and friendship makes them enduring favorites across multiple Disney eras.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Chip 'n Dale",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_chip_n_dale",
    "background_image_1": "s0_chip_n_dale",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 20,
    "url_id": "cinderella",
    "name": "Cinderella",
    "short_description": "A kind-hearted young woman forced into servitude by her cruel stepfamily, who dreams of a better life and finds magic with the help of her fairy godmother and a glass slipper.",
    "long_description": "Cinderella is a young woman living with her cruel stepmother Lady Tremaine and two stepsisters, Anastasia and Drizella. After the death of her father, Cinderella is forced to become a servant in her own home, doing all the household chores while wearing ragged clothes. Despite her hardships, Cinderella remains kind, gentle, and optimistic, often singing and dreaming of a better life. Her kindness is rewarded when her fairy godmother appears and magically transforms her rags into a beautiful gown, glass slippers, and a carriage made from a pumpkin. At the royal ball, Cinderella captures the heart of Prince Charming, but must flee at midnight when the magic ends, leaving behind one glass slipper. The prince searches the kingdom to find the mysterious girl who fits the slipper, ultimately finding Cinderella and giving her the happily ever after she deserves.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cinderella",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_cinderella",
    "background_image_1": "s0_cinderella",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 21,
    "url_id": "cogsworth",
    "name": "Cogsworth",
    "short_description": "Cogsworth, the tightly-wound majordomo from Beauty and the Beast, becomes an enchanted clock as a result of the curse on the Beast's castle.",
    "long_description": "Cogsworth, the tightly-wound majordomo from Beauty and the Beast, becomes an enchanted clock as a result of the curse on the Beast's castle. He is proper, meticulous, and a stickler for rules. His formal personality serves as a humorous contrast to Lumière's flamboyant charm. Despite being cautious and anxious, Cogsworth deeply cares about the well-being of the castle's residents. He often tries to maintain order amid chaos, even when his plans fall apart spectacularly. His attempts at leadership, though comical, show his sense of responsibility. Cogsworth's interactions with Lumière create some of the film's funniest moments. Together, they represent balance—structure vs. spontaneity. His eventual return to human form highlights how the curse forced him to confront both his rigidity and his vulnerabilities.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_cogsworth",
    "background_image_1": "s0_cogsworth",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 22,
    "url_id": "cruella_de_vil",
    "name": "Cruella De Vil",
    "short_description": "A fashion-obsessed socialite with a distinctive spotted coat who will stop at nothing to create the perfect fur coat from 101 Dalmatians.",
    "long_description": "Cruella De Vil is a wealthy, fashion-obsessed socialite known for her half-black, half-white hair, cigarette holder, and distinctive spotted fur coat. She becomes obsessed with creating the perfect spotted fur coat and decides to steal and skin the 101 Dalmatians owned by Roger and Anita Radcliffe. Cruella's character is defined by her vanity, selfishness, and willingness to commit crimes for fashion. She hires two bumbling criminals, Jasper and Horace, to kidnap the puppies. Despite her villainous nature, Cruella is one of Disney's most stylish and memorable villains. Her obsession with spots and fur represents the dangers of vanity and the ethical issues surrounding animal rights and fashion.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "101 Dalmatians",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_cruella_de_vil",
    "background_image_1": "s0_cruella_de_vil",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 23,
    "url_id": "daisy_duck",
    "name": "Daisy Duck",
    "short_description": "Daisy Duck is stylish, confident, and outspoken—often serving as a foil and love interest to Donald Duck.",
    "long_description": "Daisy Duck is stylish, confident, and outspoken—often serving as a foil and love interest to Donald Duck. She exudes sophistication, with a flair for fashion and a strong sense of self. Daisy is assertive and unafraid to speak her mind, making her one of Disney's most empowered classic characters. Her relationship with Donald is a mix of affection and frustration. Daisy loves him, but she often pushes him to be better, encouraging him to manage his temper and act more maturely. Their interactions create comedic yet heartfelt moments. Daisy is also a loyal friend to Minnie Mouse and the core \"Disney girls\" group. Whether she's solving problems, hosting events, or embarking on adventures, Daisy brings charisma and leadership. She remains a timeless character who blends elegance with strength.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Donald Duck",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_daisy_duck",
    "background_image_1": "s0_daisy_duck",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 24,
    "url_id": "doc_mcstuffins",
    "name": "Doc McStuffins",
    "short_description": "Doc McStuffins is a caring and imaginative girl who acts as a doctor to toys and stuffed animals.",
    "long_description": "Doc McStuffins is a caring and imaginative girl who acts as a doctor to toys and stuffed animals. Her magical stethoscope brings her patients to life, allowing her to diagnose, comfort, and heal them. Doc teaches young viewers empathy, resilience, and the power of helping others. Each episode focuses on problem-solving through kindness. Doc listens carefully to her patients, demonstrating communication and emotional intelligence. Her clinic becomes a metaphor for the importance of care—both physical and emotional. Through her supportive family and diverse group of toy friends, Doc represents empowerment. She inspires children to dream big, break boundaries, and imagine themselves in roles that shape the world. Doc McStuffins is not just a character; she's a role model.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_doc_mcstuffins",
    "background_image_1": "s0_doc_mcstuffins",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 25,
    "url_id": "donald_duck",
    "name": "Donald Duck",
    "short_description": "Mickey's hot-tempered but loyal best friend, a white-feathered duck known for his distinctive voice, sailor hat, and endless string of bad luck.",
    "long_description": "Donald Duck is Mickey Mouse's best friend and one of Disney's most iconic characters. A white-feathered duck with a red-orange bill, legs, and feet, Donald is known for his sailor hat, blue shirt, and explosive temper. Despite his short temper and frequent bad luck, Donald has a good heart and is fiercely loyal to his friends. He often finds himself in comedic situations involving his three nephews (Huey, Dewey, and Louie), his girlfriend Daisy Duck, and his rival Gladstone Gander. Donald's distinctive voice, created by voice actor Clarence Nash, has made him a beloved character for generations. He represents the everyman - someone who tries hard but often faces misfortune, yet never gives up.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Disney Shorts",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_donald_duck",
    "background_image_1": "s0_donald_duck",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 26,
    "url_id": "dopey",
    "name": "Dopey",
    "short_description": "Dopey is the youngest and silliest of the Seven Dwarfs in Snow White and the Seven Dwarfs. He is known for his expressive face, playful behavior.",
    "long_description": "Dopey is the youngest and silliest of the Seven Dwarfs in Snow White and the Seven Dwarfs. He is known for his expressive face, playful behavior, and endearing innocence. Unlike the other dwarfs, he doesn't speak, instead communicating through gestures and exaggerated expressions. His clumsiness and curiosity bring much of the film's humor. Whether he's tripping over his own feet or interacting with Snow White in charming, goofy ways, Dopey adds warmth and levity to the story. His actions often reflect childlike wonder. Dopey's silent loyalty makes him captivating. He may not use words, but his heart speaks clearly through his kindness and devotion. Over time, audiences have come to see him as the emotional center of the dwarf family.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Snow White and the Seven Dwarfs",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_dopey",
    "background_image_1": "s0_dopey",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 27,
    "url_id": "dumbo",
    "name": "Dumbo",
    "short_description": "A young elephant with oversized ears who overcomes bullying and learns to fly, discovering that his 'disability' is actually his greatest strength.",
    "long_description": "Dumbo is a young circus elephant born with comically large ears that make him the target of ridicule from other animals and humans. Separated from his mother and forced to perform humiliating acts, Dumbo feels worthless and alone. With the help of his friend Timothy Mouse and a group of crows, Dumbo discovers that his large ears actually allow him to fly when he believes in himself. His journey from outcast to star performer teaches powerful lessons about self-confidence, overcoming adversity, and embracing one's unique qualities. Dumbo's story is one of the most touching in Disney's canon, emphasizing that what makes us different can also make us special.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Dumbo",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_dumbo",
    "background_image_1": "s0_dumbo",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 28,
    "url_id": "eeyore",
    "name": "Eeyore",
    "short_description": "Eeyore is the gloomy yet lovable donkey from Winnie the Pooh. He's known for his slow, melancholic voice and pessimistic outlook.",
    "long_description": "Eeyore is the gloomy yet lovable donkey from Winnie the Pooh. He's known for his slow, melancholic voice and pessimistic outlook, often delivered with dry humor. His tail—frequently falling off—symbolizes the ongoing challenges he faces. Despite his sadness, Eeyore is incredibly self-aware. He doesn't seek attention or pity; he simply accepts life's hardships with quiet endurance. His friends, especially Pooh and Piglet, care deeply about him, showing that kindness can brighten even the cloudiest days. Eeyore's presence reminds viewers that not everyone expresses happiness the same way. He teaches empathy, patience, and the importance of supporting those who may struggle silently. He may be gloomy, but he is deeply loved.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Winnie the Pooh",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_eeyore",
    "background_image_1": "s0_eeyore",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 29,
    "url_id": "elena",
    "name": "Elena",
    "short_description": "Elena of Avalor is a brave, compassionate princess who becomes queen after rescuing her kingdom from an evil sorceress.",
    "long_description": "Elena of Avalor is a brave, compassionate princess who becomes queen after rescuing her kingdom from an evil sorceress. Her journey is about learning to lead with wisdom, courage, and grace. Elena's vibrant personality and sense of justice guide her decisions as she rebuilds trust within Avalor. Elena confronts magical threats, political tensions, and her own insecurities. Through each challenge, she grows into a strong ruler who listens to her people and values tradition while encouraging progress. Her family and friends support her as she balances authority with empathy. Elena represents empowerment, cultural pride, and resilience. Her story integrates Latin-inspired mythology, music, and themes of community, making her a powerful role model for young viewers.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Elena of Avalor",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_elena",
    "background_image_1": "s0_elena",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 30,
    "url_id": "elsa",
    "name": "Elsa",
    "short_description": "Queen of Arendelle with magical ice powers, struggling to control her abilities while learning that love is the key to mastering her gifts and connecting with others.",
    "long_description": "Elsa is the elder sister of Princess Anna and the Queen of Arendelle, possessing magical powers to create ice and snow. Born with these abilities, Elsa accidentally injures her sister Anna as a child and isolates herself to protect others, building emotional walls around her heart. When her powers are revealed during her coronation, she flees into the mountains, accidentally unleashing an eternal winter on her kingdom. Through her journey of self-discovery, Elsa learns to embrace her powers rather than fear them, discovering that love - particularly her love for her sister - is the key to controlling her magic. She transforms from a fearful, isolated queen into a confident, compassionate ruler who uses her powers to bring joy and beauty to her people. Elsa represents self-acceptance, inner strength, and the courage to be different.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Frozen",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_elsa",
    "background_image_1": "s0_elsa",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 31,
    "url_id": "evie",
    "name": "Evie",
    "short_description": "Evie, daughter of the Evil Queen in Descendants, is stylish, intelligent, and ambitious. Though raised to value beauty above all else.",
    "long_description": "Evie, daughter of the Evil Queen in Descendants, is stylish, intelligent, and ambitious. Though raised to value beauty above all else, she learns to appreciate her academic strength and emotional depth. Her signature blue hair and fashion sense reflect her vibrant personality. Evie's friendship with Mal helps her discover her self-worth. She evolves from someone defined by her mother's expectations into an independent thinker who chooses goodness. Her talent for science, chemistry, and creativity leads her to become a successful designer and inventor. Her arc explores identity, redemption, and breaking free from toxic legacies. Evie proves that you are not your parents—you are the choices you make.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Descendants",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_evie",
    "background_image_1": "s0_evie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 32,
    "url_id": "evil_queen",
    "name": "Evil Queen",
    "short_description": "The Evil Queen from Snow White is one of Disney's most iconic villains. Obsessed with beauty and power, she embodies vanity taken to dangerous extremes.",
    "long_description": "The Evil Queen from Snow White is one of Disney's most iconic villains. Obsessed with beauty and power, she embodies vanity taken to dangerous extremes. Her cold demeanor and calculating intelligence make her a formidable antagonist. Her transformation into the old hag reflects her willingness to sacrifice everything—even her own appearance—to destroy Snow White. This obsession exposes the insecurity beneath her regal facade. Her fall is a cautionary tale about envy and unchecked pride. The Evil Queen's legacy continues through retellings, adaptations, and references across Disney history. She remains a powerful symbol of dark ambition and the destructive force of jealousy.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Snow White and the Seven Dwarfs",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_evil_queen",
    "background_image_1": "s0_evil_queen",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 33,
    "url_id": "fairies",
    "name": "Fairies",
    "short_description": "Disney Fairies—especially those from Tinker Bell and Pixie Hollow—represent magic, nature, and creativity. Each fairy has a unique talent.",
    "long_description": "Disney Fairies—especially those from Tinker Bell and Pixie Hollow—represent magic, nature, and creativity. Each fairy has a unique talent, such as tinkering, gardening, water shaping, or light manipulation. These abilities show the importance of embracing one's strengths. The world of Pixie Hollow explores teamwork, friendship, and celebrating differences. Fairies face challenges that require cooperation and trust. Their stories teach resilience, curiosity, and problem-solving through magical adventures. Fairies also reflect the beauty of nature. Their environments, tasks, and personalities draw from plants, seasons, and elements, creating a rich tapestry of wonder.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Fairly OddParents",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_fairies",
    "background_image_1": "s0_fairies",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 34,
    "url_id": "figment",
    "name": "Figment",
    "short_description": "Figment is the imaginative purple dragon from EPCOT's Journey Into Imagination. He represents creativity, curiosity, and the limitless potential of imagination.",
    "long_description": "Figment is the imaginative purple dragon from EPCOT's Journey Into Imagination. He represents creativity, curiosity, and the limitless potential of the imagination. His playful nature and energy make him a beloved symbol of Disney's creative spirit. Figment encourages visitors to think beyond the ordinary—to explore, invent, and dream. His partnership with the Dreamfinder in earlier versions of the ride highlighted the joy of creative discovery. Even today, he inspires nostalgia and whimsy. As a character, Figment embodies Disney's core theme: imagination can build entire worlds. His presence in EPCOT serves as a reminder that creativity fuels innovation.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Epcot",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_figment",
    "background_image_1": "s0_figment",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 35,
    "url_id": "flash",
    "name": "Flash",
    "short_description": "Flash, the sloth from Zootopia, works at the DMV and has become a comedic icon thanks to his incredibly slow speech and movement.",
    "long_description": "Flash, the sloth from Zootopia, works at the DMV and has become a comedic icon thanks to his incredibly slow speech and movement. His scenes illustrate the hilarious contrast between urgency and sloth-like pace. Despite his slow behavior, Flash has a surprising playful streak. His deadpan expressions and unexpected laughter add depth to his character, making him more than just a one-note joke. His interactions with Judy and Nick show that personality can't be judged by appearance. Flash has become a symbol of patience—and the lack of it—in modern life. His scenes are both relatable and timeless.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Flash",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_flash",
    "background_image_1": "s0_flash",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 36,
    "url_id": "flounder",
    "name": "Flounder",
    "short_description": "Flounder is Ariel's loyal best friend in The Little Mermaid. Although timid and nervous, he supports Ariel unconditionally.",
    "long_description": "Flounder is Ariel's loyal best friend in The Little Mermaid. Although timid and nervous, he supports Ariel unconditionally, even when her curiosity leads them into danger. His loyalty reflects the strength of their friendship. Flounder often finds himself pushed outside his comfort zone. Yet, in moments that matter, he finds bravery within himself. His devotion helps Ariel navigate the challenges of both sea and land. His bright colors, expressive face, and heartfelt moments make him one of Disney's most memorable sidekicks. Flounder teaches that courage isn't the absence of fear—it's acting in spite of it.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Little Mermaid",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_flounder",
    "background_image_1": "s0_flounder",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 37,
    "url_id": "flower",
    "name": "Flower",
    "short_description": "Flower, the gentle skunk from Bambi, is shy, sweet, and soft-spoken. Despite his name, he embraces the compliment wholeheartedly.",
    "long_description": "Flower, the gentle skunk from Bambi, is shy, sweet, and soft-spoken. Despite his name, he embraces the compliment wholeheartedly, showing humility and friendliness. His bashful nature creates tender, humorous moments. Throughout Bambi, Flower exemplifies kindness. He supports Bambi and Thumper as they grow, explore, and face life's challenges. His innocence and charm bring warmth to the forest scenes. Flower represents the beauty of gentleness in nature. He reminds viewers that quiet personalities can have deep emotional impact.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Bambi",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_flower",
    "background_image_1": "s0_flower",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 38,
    "url_id": "flynn_rider",
    "name": "Flynn Rider",
    "short_description": "Flynn Rider, also known as Eugene Fitzherbert, is the charismatic thief-turned-hero of Tangled. He begins his story with a roguish smile.",
    "long_description": "Flynn Rider, also known as Eugene Fitzherbert, is the charismatic thief-turned-hero of Tangled. He begins his story with a roguish smile and selfish motives, driven by dreams of wealth and freedom. His sarcastic humor and dramatic flair make him instantly charming. Rapunzel's influence softens Flynn's heart. Through her optimism, he discovers his true self—Eugene, someone capable of love, sacrifice, and honesty. His transformation is one of Disney's strongest redemption arcs. He learns that true treasure lies not in material wealth but in meaningful connection. Flynn's bravery, humor, and emotional growth make him one of Disney's most beloved modern heroes. His dynamic with Rapunzel blends comedy with sincerity.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Tangled",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_flynn_rider",
    "background_image_1": "s0_flynn_rider",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 39,
    "url_id": "fozzie_bear",
    "name": "Fozzie Bear",
    "short_description": "Fozzie Bear, the stand-up comedian of The Muppets, is known for his corny jokes, lovable awkwardness, and signature \"Wocka wocka!\"",
    "long_description": "Fozzie Bear, the stand-up comedian of The Muppets, is known for his corny jokes, lovable awkwardness, and signature \"Wocka wocka!\" Despite constant heckling—especially from Statler and Waldorf—Fozzie remains optimistic and dedicated to his craft. His earnestness makes him charming. Fozzie truly believes in his ability to make people laugh, even when his jokes flop. This perseverance is both humorous and inspiring. He represents the courage required to pursue creative passions. Fozzie's friendship with Kermit is one of the emotional anchors of The Muppets. Their bond highlights loyalty, teamwork, and mutual support, even in the face of chaos.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Muppets",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_fozzie_bear",
    "background_image_1": "s0_fozzie_bear",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 40,
    "url_id": "gaston",
    "name": "Gaston",
    "short_description": "The arrogant, narcissistic villager who believes he's the most handsome and desirable man in town, obsessed with marrying Belle and killing the Beast.",
    "long_description": "Gaston is the arrogant, narcissistic villager in a provincial French town, known for his good looks, strength, and belief that he is the most desirable man around. He spends his days admiring himself in mirrors, hunting, and expecting everyone to worship him. When Belle rejects his marriage proposal, Gaston becomes obsessed with proving his superiority by killing the Beast and winning Belle's affection. His character represents vanity, toxic masculinity, and the dangers of unchecked ego. Despite his villainous traits, Gaston provides comic relief with his exaggerated self-importance and the humorous song 'Gaston.' He serves as a contrast to the Beast's character development, showing how true love comes from within rather than outward appearance.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_gaston",
    "background_image_1": "s0_gaston",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 41,
    "url_id": "genie",
    "name": "Genie",
    "short_description": "A powerful spirit trapped in a lamp for centuries, granting wishes with humor and flair while helping Aladdin become the hero he was meant to be.",
    "long_description": "The Genie is a magical, wisecracking spirit who has been trapped in a lamp for 10,000 years, granting wishes to whoever possesses it. With the power to grant three wishes to his master, the Genie uses his magic, humor, and showmanship to help Aladdin navigate the challenges of palace life and defeat the evil sorcerer Jafar. Despite his immense power, the Genie longs for freedom and finds true friendship with Aladdin, who ultimately frees him without using his third wish. The Genie's character is defined by his boundless energy, musical numbers, shape-shifting abilities, and Robin Williams' iconic performance. He represents freedom, friendship, and the joy of living life to the fullest.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Genie",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_genie",
    "background_image_1": "s0_genie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 42,
    "url_id": "goofy",
    "name": "Goofy",
    "short_description": "Mickey's clumsy but good-hearted friend, an anthropomorphic dog known for his distinctive laugh, orange hat, and well-meaning but often disastrous attempts at being helpful.",
    "long_description": "Goofy is Mickey Mouse's other best friend and a member of Disney's classic trio. An anthropomorphic dog with a distinctive laugh ('Yah-hoo-hoo-hooey!'), Goofy is known for his orange hat, brown fur, and clumsy, well-meaning personality. Despite his awkwardness and tendency to cause accidental chaos, Goofy has a heart of gold and is incredibly loyal to his friends. He often tries to be sophisticated or knowledgeable but ends up in hilarious situations due to his clumsiness. Goofy's character provides comic relief while also showing that it's okay to be different and that true friendship accepts you for who you are. His catchphrase 'Gawrsh!' has become iconic in pop culture.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Disney Shorts",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_goofy",
    "background_image_1": "s0_goofy",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 43,
    "url_id": "grumpy",
    "name": "Grumpy",
    "short_description": "The perpetually grumpy dwarf who is always complaining but has a heart of gold beneath his rough exterior.",
    "long_description": "Grumpy is one of Snow White's seven dwarfs, known for his constant grumbling and pessimistic outlook on life. Despite his sour disposition and frequent complaints about everything from work to weather, Grumpy has a soft spot for Snow White and genuinely cares about his fellow dwarfs. His grumpiness often provides comic relief, but he proves his loyalty and bravery when he helps rescue Snow White from the Evil Queen. Grumpy represents the idea that even those who seem perpetually unhappy can have deep feelings and make important contributions to their community. His catchphrase 'Aw, nuts!' has become iconic in Disney lore.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Snow White and the Seven Dwarfs",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_grumpy",
    "background_image_1": "s0_grumpy",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 44,
    "url_id": "gus",
    "name": "Gus",
    "short_description": "One of Cinderella's mice friends who helps her with household chores and dreams of becoming a coachman.",
    "long_description": "Gus is one of Cinderella's loyal mouse friends who lives in the castle and helps her with chores despite the dangers posed by Lucifer the cat. Along with his fellow mice Jaq and Mary, Gus assists Cinderella in her daily tasks and helps create her iconic ball gown. Gus dreams of becoming a coachman and gets his wish when the Fairy Godmother transforms him. Though small in size, Gus shows great courage and determination, representing the power of friendship and believing in one's dreams no matter the obstacles. His adventures highlight themes of loyalty, perseverance, and the magic of kindness.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cinderella",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_gus",
    "background_image_1": "s0_gus",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 45,
    "url_id": "hissy",
    "name": "Hissy",
    "short_description": "The sassy snake companion of Kaa who provides comic relief with her dramatic personality and fear of mice.",
    "long_description": "Hissy is Kaa's loyal but high-strung snake companion in The Rescuers Down Under. Known for her dramatic personality and exaggerated reactions, Hissy is terrified of mice and often provides comic relief with her sassy remarks and fearful outbursts. Despite her cowardice, Hissy shows loyalty to her friend Kaa and attempts to help in their schemes. Her character represents the contrast between appearance and reality, as well as the humor that comes from overcoming fears. Though she appears tough, Hissy's true nature is revealed through her vulnerability and friendship.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_hissy",
    "background_image_1": "s0_hissy",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 46,
    "url_id": "jack_skellington",
    "name": "Jack Skellington",
    "short_description": "The Pumpkin King of Halloween Town who discovers Christmas and tries to bring holiday cheer to his town, learning about the true meaning of both holidays.",
    "long_description": "Jack Skellington is the Pumpkin King of Halloween Town, where he leads the annual Halloween celebrations with enthusiasm and creativity. Bored with the same routine year after year, Jack accidentally discovers Christmas Town and becomes fascinated with the holiday. He decides to take over Christmas to bring the joy of Halloween to the world, but learns that Christmas is about love, family, and giving - not fear and tricks. With the help of his girlfriend Sally and Santa Claus, Jack saves Christmas and returns to Halloween Town with a new appreciation for both holidays. Jack represents creativity, curiosity, and the importance of understanding different perspectives and traditions.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Nightmare Before Christmas",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jack_skellington",
    "background_image_1": "s0_jack_skellington",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 47,
    "url_id": "jaq",
    "name": "Jaq",
    "short_description": "Cinderella's clever mouse friend who leads the mice in helping her and serves as the brains of the operation.",
    "long_description": "Jaq is the leader of Cinderella's mouse friends and serves as the intelligent, quick-thinking member of the group. Along with Gus and Mary, Jaq helps Cinderella with household chores and plays a key role in creating her ball gown. Jaq is known for his cleverness, bravery, and leadership skills, often coming up with plans to outsmart Lucifer the cat and Lady Tremaine. Despite his small size, Jaq shows remarkable courage and determination, representing intelligence, loyalty, and the power of working together. His friendship with Cinderella highlights themes of kindness and mutual support in the face of adversity.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cinderella",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jaq",
    "background_image_1": "s0_jaq",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 48,
    "url_id": "jasmine",
    "name": "Jasmine",
    "short_description": "The strong-willed princess of Agrabah who rejects traditional royal expectations, finding true love with the street-smart thief Aladdin.",
    "long_description": "Princess Jasmine is the daughter of the Sultan of Agrabah and a strong-willed, independent young woman who refuses to be married off to suitors chosen by her father. Tired of palace life and royal expectations, she sneaks out into the marketplace where she meets Aladdin, initially disguised as Prince Ali. Jasmine values honesty, kindness, and intelligence over wealth and status. She helps Aladdin defeat the evil sorcerer Jafar and becomes a wise, compassionate ruler alongside her husband. Jasmine breaks traditional Disney princess stereotypes by being outspoken, intelligent, and proactive in shaping her own destiny. Her character represents female empowerment, cultural diversity, and the importance of being true to oneself.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Aladdin",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jasmine",
    "background_image_1": "s0_jasmine",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 49,
    "url_id": "jiminy_cricket",
    "name": "Jiminy Cricket",
    "short_description": "Pinocchio's wise conscience and guide, a cricket who teaches lessons about honesty, bravery, and doing the right thing.",
    "long_description": "Jiminy Cricket serves as Pinocchio's conscience and moral guide throughout his adventures. Appointed by the Blue Fairy to be Pinocchio's official conscience, Jiminy tries to keep the wooden boy on the straight and narrow path to becoming a real boy. Though often exasperated by Pinocchio's mischievous nature, Jiminy shows patience, wisdom, and unwavering loyalty. He represents moral guidance, the importance of honesty, and the value of having a clear conscience. Jiminy's journey with Pinocchio teaches valuable lessons about responsibility, truthfulness, and the rewards of doing what's right, even when it's difficult.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Pinocchio",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jiminy_cricket",
    "background_image_1": "s0_jiminy_cricket",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 50,
    "url_id": "judy_hopps",
    "name": "Judy Hopps",
    "short_description": "A determined young rabbit who becomes Zootopia's first bunny police officer, fighting prejudice and solving a mystery.",
    "long_description": "Judy Hopps is a optimistic and determined young rabbit who overcomes societal prejudices to become the first bunny police officer in Zootopia. Despite being told that bunnies aren't meant for police work, Judy pursues her dream with unwavering determination and graduates at the top of her class. When she arrives in Zootopia, she faces discrimination and doubt from others, but teams up with Nick Wilde to solve a series of mysterious disappearances. Through her experiences, Judy learns about prejudice, friendship, and the complexity of the world. Her character represents perseverance, breaking stereotypes, and the importance of seeing beyond surface differences to understand others.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Zootopia",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_judy_hopps",
    "background_image_1": "s0_judy_hopps",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 51,
    "url_id": "kermit_the_frog",
    "name": "Kermit the Frog",
    "short_description": "The optimistic frog who leads the Muppets, always trying to keep everything running smoothly despite constant chaos.",
    "long_description": "Kermit the Frog is the optimistic, level-headed leader of the Muppets who tries to keep his eccentric friends on track despite constant chaos and mishaps. As the owner and producer of the Muppet Theater, Kermit is always striving to put on the best show possible, but often finds himself dealing with the unpredictable antics of Miss Piggy, Fozzie Bear, and the others. Despite the frustrations, Kermit's kind heart and positive attitude never waver. He represents leadership, perseverance, and the belief that with teamwork and friendship, anything is possible. Kermit's famous sign-off 'Yippee!' captures his eternal optimism and joy for life.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Muppets",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_kermit_the_frog",
    "background_image_1": "s0_kermit_the_frog",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 52,
    "url_id": "kristoff",
    "name": "Kristoff",
    "short_description": "A rugged ice harvester who lives in the mountains with Sven, learning about love and family through his relationship with Anna.",
    "long_description": "Kristoff is a rugged, independent ice harvester who lives in the mountains of Arendelle with his loyal reindeer Sven. Orphaned as a child and raised by trolls, Kristoff has learned to be self-sufficient and wary of palace life. When he meets Princess Anna, he reluctantly agrees to help her find her sister Elsa. Through their journey, Kristoff learns about love, trust, and the importance of family. His practical nature and survival skills complement Anna's optimism and determination. Kristoff represents the value of honesty, hard work, and opening one's heart to love. His relationship with Sven demonstrates the deep bonds that can form between humans and animals.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Frozen",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_kristoff",
    "background_image_1": "s0_kristoff",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 53,
    "url_id": "lambie",
    "name": "Lambie",
    "short_description": "A soft, cuddly lamb who is part of Doc McStuffins' toy friends, always ready to help with hugs and comfort.",
    "long_description": "Lambie is a soft, pink stuffed lamb and one of Doc McStuffins' closest toy friends. Known for her gentle nature and love of hugs, Lambie serves as the emotional support for the other toys. When toys get hurt or feel down, Lambie is always there with comfort and reassurance. Despite her cuddly appearance, Lambie shows courage when needed and helps Doc solve problems. She represents kindness, empathy, and the healing power of comfort and affection. Lambie's catchphrase 'Don't worry, I'll give you a big hug!' captures her caring personality and role as the group's emotional anchor.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_lambie",
    "background_image_1": "s0_lambie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 54,
    "url_id": "lilo",
    "name": "Lilo",
    "short_description": "A young Hawaiian girl who adopts Stitch as her dog, teaching him about love, family, and 'ohana' while dealing with her own grief.",
    "long_description": "Lilo is a young Hawaiian girl who lives with her older sister Nani on the island of Kauai. After losing her parents, Lilo struggles with feelings of loneliness and anger, finding solace in her love for Elvis Presley and hula dancing. When she adopts what she thinks is a dog (actually the alien experiment Stitch), Lilo teaches him about love, family, and the Hawaiian concept of 'ohana' (family). Despite her young age, Lilo shows remarkable wisdom, courage, and compassion. Her journey with Stitch helps both of them heal from their past traumas and find a sense of belonging. Lilo represents resilience, the power of love to heal wounds, and the importance of family bonds.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Lilo & Stitch",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_lilo",
    "background_image_1": "s0_lilo",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 55,
    "url_id": "lumiere",
    "name": "Lumiere",
    "short_description": "The elegant candelabra who serves as the majordomo of the Beast's castle, bringing romance and sophistication to the enchanted household.",
    "long_description": "Lumiere is an elegant, sophisticated candelabra who serves as the majordomo (head butler) of the Beast's enchanted castle. Originally a human, Lumiere was transformed into a candelabra along with the other castle staff by an enchantress's curse. Despite his new form, Lumiere maintains his refined manners, French accent, and love of romance. He takes it upon himself to help the Beast learn proper etiquette and manners, believing that true love will break the curse. Lumiere's optimism and belief in romance provide comic relief and hope throughout the story. He represents sophistication, loyalty, and the enduring power of love and kindness.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_lumiere",
    "background_image_1": "s0_lumiere",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 56,
    "url_id": "mad_hatter",
    "name": "Mad Hatter",
    "short_description": "The eccentric hatter who hosts the most maddening tea party in Wonderland, known for his riddles and unbirthday celebrations.",
    "long_description": "The Mad Hatter is one of the most eccentric and memorable characters in Alice's Adventures in Wonderland. Known for hosting perpetual tea parties and celebrating 'unbirthdays' (every day except one's actual birthday), the Hatter is a hatter by trade but has gone quite mad, possibly from exposure to mercury in hat-making materials. He speaks in riddles, changes seats constantly during tea, and has a peculiar sense of time. Despite his madness, the Hatter shows glimpses of wisdom and kindness, particularly in his friendship with the March Hare and Dormouse. He represents creativity, the absurdity of logic, and the joy of celebrating life in unconventional ways.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Alice in Wonderland",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mad_hatter",
    "background_image_1": "s0_mad_hatter",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 57,
    "url_id": "mal",
    "name": "Mal",
    "short_description": "The daughter of Maleficent who struggles with her mother's legacy of evil while discovering her own identity and the power of love.",
    "long_description": "Mal is the daughter of the evil fairy Maleficent and Hades, raised on the Isle of the Lost with the other villain kids. Trained to be just like her mother, Mal initially embraces her villainous heritage and leads a plot to steal the Fairy Godmother's wand. However, as she spends time in Auradon, Mal begins to question her mother's teachings and discovers her own capacity for love and goodness. Her relationship with Ben, the prince of Auradon, helps her break free from her mother's shadow. Mal represents the struggle between nature and nurture, the possibility of redemption, and the power of love to overcome a dark legacy.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Descendants",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mal",
    "background_image_1": "s0_mal",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 58,
    "url_id": "maleficent",
    "name": "Maleficent",
    "short_description": "A powerful fairy cursed by anger and betrayal, who places a curse on Princess Aurora but ultimately learns that love and redemption are stronger than hate.",
    "long_description": "Maleficent is a powerful fairy with horns, wings, and magical abilities who serves as the main antagonist in Sleeping Beauty. Betrayed and humiliated at Aurora's christening when she's not invited by King Stefan, Maleficent curses the infant princess to die on her 16th birthday by pricking her finger on a spinning wheel. The good fairies modify the curse to a deep sleep that can be broken by true love's kiss. Maleficent's character evolves from pure villainy to someone capable of change and redemption. Her story explores themes of betrayal, the corrupting power of anger, and the possibility of redemption. Maleficent represents the complexity of evil and the idea that even the most hardened hearts can be softened by love and understanding.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sleeping Beauty",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_maleficent",
    "background_image_1": "s0_maleficent",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 59,
    "url_id": "marie",
    "name": "Marie",
    "short_description": "The elegant white kitten of the Aristocats, known for her sophisticated personality and love of luxury.",
    "long_description": "Marie is the elegant, sophisticated white kitten and the only female among the three Aristocats kittens. With her blue eyes and refined manners, Marie dreams of a life of luxury and often acts more mature than her age. Despite her delicate appearance, Marie shows courage during the Aristocats' adventure through Paris. She represents grace, sophistication, and the contrast between appearance and inner strength. Marie's relationship with her mother Duchess and brothers Berlioz and Toulouse highlights the bonds of family and the importance of sticking together through adversity.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Aristocats",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_marie",
    "background_image_1": "s0_marie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 60,
    "url_id": "maui",
    "name": "Maui",
    "short_description": "The boastful demigod who accompanies Moana on her voyage, using his magical fishhook and larger-than-life personality to help restore Te Fiti.",
    "long_description": "Maui is a boastful, larger-than-life demigod in Polynesian mythology, known for his incredible strength, magical fishhook, and ability to shapeshift. Once worshipped as a god, Maui became forgotten by humans and developed an inflated ego to compensate. When he meets Moana, he initially sees her as a means to regain his glory, but gradually forms a genuine friendship. Maui's journey with Moana helps him rediscover his purpose and the true meaning of being a hero. He represents confidence, self-discovery, and the idea that everyone has inherent worth beyond their accomplishments. Maui's humorous personality and catchy songs make him one of Disney's most memorable sidekicks.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Moana",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_maui",
    "background_image_1": "s0_maui",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 61,
    "url_id": "meeko",
    "name": "Meeko",
    "short_description": "Pocahontas's mischievous raccoon friend who provides comic relief with his playful antics and love of shiny objects.",
    "long_description": "Meeko is Pocahontas's loyal but mischievous raccoon companion who follows her everywhere through the forests of Virginia. Known for his love of shiny objects and playful personality, Meeko often gets into trouble but always manages to help Pocahontas in his own way. Despite his thieving tendencies and hunger for food, Meeko shows bravery when protecting his friends. He represents the joy of living in the moment, the bond between humans and nature, and the humor that comes from innocent mischief. Meeko's friendship with Pocahontas highlights the harmony between different species and the importance of friendship across differences.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Pocahontas",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_meeko",
    "background_image_1": "s0_meeko",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 62,
    "url_id": "mickey_mouse",
    "name": "Mickey Mouse",
    "short_description": "The cheerful, optimistic mouse who is Disney's most iconic character, known for his red shorts, white gloves, and big ears, representing fun, friendship, and adventure.",
    "long_description": "Mickey Mouse is Walt Disney's most famous and beloved creation, first appearing in the 1928 short film Steamboat Willie. Originally named Mortimer Mouse, he was renamed Mickey at the suggestion of Walt's wife Lillian. Mickey is an anthropomorphic mouse characterized by his red shorts, large yellow shoes, white gloves, and expressive round ears. He embodies optimism, kindness, and a sense of adventure. Mickey has starred in hundreds of cartoons, films, and television shows, often accompanied by his girlfriend Minnie Mouse, best friend Donald Duck, and dog Pluto. As the official mascot of The Walt Disney Company, Mickey represents the magic, creativity, and joy that Disney brings to millions of people worldwide. His enduring popularity spans generations, making him a symbol of childhood innocence and imagination.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Disney Shorts",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mickey_mouse",
    "background_image_1": "s0_mickey_mouse",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 63,
    "url_id": "minnie_mouse",
    "name": "Minnie Mouse",
    "short_description": "Minnie Mouse is the embodiment of sweetness, style, and classic Disney charm. As Mickey's longtime partner, she brings warmth and grace to every story.",
    "long_description": "Minnie Mouse is the embodiment of sweetness, style, and classic Disney charm. As Mickey's longtime partner, she brings warmth and grace to every story she's part of. Her signature polka dots, bows, and upbeat personality make her instantly recognizable. Minnie is not just a fashion icon; she's kind, nurturing, and resourceful. Whether she's helping friends, solving problems, or planning events, Minnie displays intelligence and leadership. She is often the glue that holds the Disney crew together. Her role in modern shows like Mickey Mouse Clubhouse and Minnie's Bow-Toons expands her legacy, showing her creativity and entrepreneurial spirit.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Mickey Mouse",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_minnie_mouse",
    "background_image_1": "s0_minnie_mouse",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 64,
    "url_id": "miss_bunny",
    "name": "Miss Bunny",
    "short_description": "Miss Bunny appears in Bambi as the lovely, delicate rabbit who catches Thumper's eye. Her charm and gentle demeanor embody the innocence of the forest.",
    "long_description": "Miss Bunny appears in Bambi as the lovely, delicate rabbit who catches Thumper's eye. Her charm and gentle demeanor embody the innocence of the forest. She plays a small but memorable role, representing young love and nature's grace. Her interactions with Thumper are sweet, playful, and emblematic of early crushes. Miss Bunny adds warmth to the woodland world. She also reflects the natural cycle of life, growth, and companionship. Though not a major character, Miss Bunny contributes to the emotional richness of Bambi, offering a tender moment of connection.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_miss_bunny",
    "background_image_1": "s0_miss_bunny",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 65,
    "url_id": "miss_piggy",
    "name": "Miss Piggy",
    "short_description": "Miss Piggy is a glamorous force of nature—bold, dramatic, and fiercely confident. As one of The Muppets' greatest stars.",
    "long_description": "Miss Piggy is a glamorous force of nature—bold, dramatic, and fiercely confident. As one of The Muppets' greatest stars, she combines elegance with comedic flair. Her diva personality is both humorous and endearing, making her one of the most iconic Muppet characters ever created. Her relationship with Kermit the Frog is central to her character. She adores him, though her enthusiasm often overwhelms him. Their dynamic creates comedic gold and emotional depth. Miss Piggy's confidence—bordering on exaggeration—is a reflection of her self-belief and ambition. Beyond her vanity and dramatic outbursts, Miss Piggy has moments of genuine vulnerability. She works hard, loves deeply, and strives to be her best self. Her mix of glamour, strength, and comedic timing sets her apart as a legend in the Muppet universe.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Muppets",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_miss_piggy",
    "background_image_1": "s0_miss_piggy",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 66,
    "url_id": "moana",
    "name": "Moana",
    "short_description": "A brave Polynesian teenager chosen by the ocean to restore the heart of Te Fiti, embarking on an epic voyage to save her island and discover her true calling.",
    "long_description": "Moana is a strong-willed, teenage daughter of a Polynesian chief on the island of Motunui. Chosen by the ocean itself, she embarks on a daring ocean voyage to save her people from a mysterious blight threatening their island. Along the way, she teams up with the demigod Maui, faces mythical creatures, and discovers her connection to the ancient world of her ancestors. Moana learns to embrace her role as a wayfinder, using her courage, intelligence, and deep connection to the ocean to restore balance to her world. Her journey represents self-discovery, cultural heritage, environmental stewardship, and the courage to follow one's calling. Moana is celebrated for her representation of Polynesian culture and her status as Disney's first non-European princess.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Moana",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 67,
    "url_id": "mrs_potts",
    "name": "Mrs. Potts",
    "short_description": "The kind-hearted teapot who serves as the mother figure in the Beast's castle, offering wisdom and comfort to Belle.",
    "long_description": "Mrs. Potts is the warm, motherly teapot who serves as the housekeeper in the Beast's enchanted castle. Originally human, she was transformed by the enchantress's curse along with the other staff. Despite her new form, Mrs. Potts maintains her nurturing personality and serves as a voice of reason and comfort. She becomes a maternal figure to Belle, offering advice and support during her time in the castle. Her son Chip, also transformed into a teacup, adds to her protective nature. Mrs. Potts represents kindness, wisdom, and the enduring strength of maternal love. Her belief in the power of love helps sustain hope throughout the story.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Beauty and the Beast",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mrs_potts",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 68,
    "url_id": "mulan",
    "name": "Mulan",
    "short_description": "A brave young woman who disguises herself as a man to fight in the army, proving her courage and intelligence while bringing honor to her family and country.",
    "long_description": "Mulan is a determined young woman living in ancient China during the Han Dynasty. When her elderly father is drafted to fight in the army against the invading Huns, Mulan disguises herself as a man and takes his place to spare his life. In the army, she proves herself through intelligence, bravery, and quick thinking, earning the respect of her fellow soldiers and Captain Li Shang. With the help of her guardian dragon Mushu and cricket friend Cri-Kee, Mulan discovers and thwarts a plot by the villainous Shan Yu. Her heroism saves China and brings great honor to her family. Mulan represents courage, honor, intelligence, and breaking gender stereotypes, becoming one of Disney's most beloved warrior princesses.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Mulan",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mulan",
    "background_image_1": "s0_mulan",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 69,
    "url_id": "mushu",
    "name": "Mushu",
    "short_description": "Mulan's loyal dragon guardian who provides comic relief with his bravado, schemes, and attempts to help Mulan become a hero.",
    "long_description": "Mushu is a small, red dragon and Mulan's self-appointed guardian, sent by her ancestors to help her succeed in the army. Despite his small size and tendency to exaggerate his abilities, Mushu is fiercely loyal and determined to help Mulan bring honor to her family. His bravado and comedic schemes often lead to trouble, but his heart is always in the right place. Mushu represents courage, loyalty, and the idea that true heroism comes from within, not from outward appearance. His friendship with Mulan and Cri-Kee the cricket highlights themes of friendship, perseverance, and cultural heritage.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Mulan",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mushu",
    "background_image_1": "s0_mushu",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 70,
    "url_id": "nick_wilde",
    "name": "Nick Wilde",
    "short_description": "A clever fox con artist who teams up with Judy Hopps to solve a mystery, learning about friendship and overcoming prejudice.",
    "long_description": "Nick Wilde is a clever, street-smart fox who makes a living as a con artist in Zootopia, selling pawpsicles with his partner Finnick. Having faced prejudice throughout his life due to being a fox, Nick has developed a cynical worldview and uses his wits to survive. When Judy Hopps recruits him to help solve a series of disappearances, Nick initially sees it as another scam but gradually forms a genuine friendship with Judy. Through their partnership, Nick learns to trust others and confronts his own biases. He represents intelligence, resilience in the face of discrimination, and the possibility of change and friendship across differences.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Zootopia",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_nick_wilde",
    "background_image_1": "s0_nick_wilde",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 71,
    "url_id": "olaf",
    "name": "Olaf",
    "short_description": "The optimistic snowman brought to life by Elsa's magic, who loves warm hugs and provides comic relief with his naive personality.",
    "long_description": "Olaf is a cheerful, optimistic snowman brought to life by Elsa's magical ice powers. Despite being made of snow, Olaf dreams of experiencing summer and warm hugs, which he knows would be his demise but pursues anyway with childlike enthusiasm. His naive personality and endless optimism provide comic relief throughout Frozen, but he also shows wisdom and bravery when helping Anna and Kristoff. Olaf represents joy, innocence, and the beauty of living in the moment. His famous song 'In Summer' captures his longing for experiences beyond his snowy existence, reminding us that life is about embracing possibilities despite the risks.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Frozen",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_olaf",
    "background_image_1": "s0_olaf",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 72,
    "url_id": "oogie_boogie",
    "name": "Oogie Boogie",
    "short_description": "The sinister boogie man who lives in a sack and plots against Halloween Town, representing the fear of the unknown.",
    "long_description": "Oogie Boogie is the main antagonist in The Nightmare Before Christmas, a sinister, bug-filled boogie man who lives in a giant sack filled with his creepy crawler minions. As the embodiment of Halloween's dark side, Oogie Boogie despises Christmas and plots to take over Halloween Town. His gambling addiction and love of danger make him a formidable villain, but his overconfidence leads to his downfall. Oogie Boogie represents the fear of the unknown, the darkness that lurks in shadows, and the danger of letting fear control one's actions. Despite his terrifying appearance, he's ultimately defeated by the power of friendship and holiday spirit.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Nightmare Before Christmas",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_oogie_boogie",
    "background_image_1": "s0_oogie_boogie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 73,
    "url_id": "pascal",
    "name": "Pascal",
    "short_description": "Rapunzel's loyal chameleon companion who changes colors with her emotions and helps her on her journey of self-discovery.",
    "long_description": "Pascal is Rapunzel's loyal chameleon companion who serves as her silent but expressive friend throughout her journey. Able to change colors to match Rapunzel's emotions, Pascal communicates through color changes and facial expressions rather than words. Despite his small size, Pascal shows remarkable bravery and loyalty, helping Rapunzel escape her tower and navigate the dangers of the outside world. He represents the power of silent friendship, emotional intelligence, and the deep bonds that can form between different beings. Pascal's relationship with Rapunzel highlights themes of trust, companionship, and finding freedom through supportive relationships.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Tangled",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pascal",
    "background_image_1": "s0_pascal",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 74,
    "url_id": "peter_pan",
    "name": "Peter Pan",
    "short_description": "The boy who never grows up, leading Wendy and her brothers on adventures in Neverland while battling the villainous Captain Hook.",
    "long_description": "Peter Pan is the eternal boy who lives in Neverland and refuses to grow up. With the ability to fly and his fairy friend Tinker Bell, Peter represents the spirit of childhood imagination and adventure. He visits the Darling children in London, convincing Wendy, John, and Michael to fly with him to Neverland for endless adventures. There, they encounter mermaids, pirates led by the villainous Captain Hook, and the Lost Boys. Peter's carefree attitude and belief in the power of imagination make him both charming and reckless. His character explores themes of growing up, the loss of childhood innocence, and the magic of belief. Peter Pan reminds us that while adulthood brings responsibilities, the child within us should never completely disappear.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Peter Pan",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_peter_pan",
    "background_image_1": "s0_peter_pan",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 75,
    "url_id": "piglet",
    "name": "Piglet",
    "short_description": "The timid but brave little pig who is Winnie the Pooh's loyal friend, often facing his fears to help his companions.",
    "long_description": "Piglet is a small, timid pig who lives in the Hundred Acre Wood with Winnie the Pooh and his friends. Despite his fearfulness and tendency to worry about everything, Piglet shows remarkable courage when his friends need him. He often accompanies Pooh on adventures, providing comic relief with his nervous personality while also demonstrating bravery in difficult situations. Piglet represents the idea that true courage comes from facing fears, and that even the smallest individuals can make a big difference. His close friendship with Pooh shows that differences in personality can create strong bonds of loyalty and support.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Winnie the Pooh",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_piglet",
    "background_image_1": "s0_piglet",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 76,
    "url_id": "pinocchio",
    "name": "Pinocchio",
    "short_description": "A wooden puppet brought to life by a fairy, who must learn honesty and bravery to become a real boy, facing temptations and dangers along the way.",
    "long_description": "Pinocchio is a wooden puppet carved by the poor woodcarver Geppetto, who wishes upon a star for his creation to become a real boy. The Blue Fairy brings Pinocchio to life but warns him that he can only become human if he proves himself brave, truthful, and unselfish. With his nose growing when he tells lies and his adventures taking him to Pleasure Island and the belly of a whale, Pinocchio faces numerous temptations and dangers. Guided by his conscience Jiminy Cricket, Pinocchio learns valuable lessons about honesty, responsibility, and the consequences of poor choices. His journey represents the transition from childhood to adulthood and the importance of moral development.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Pinocchio",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pinocchio",
    "background_image_1": "s0_pinocchio",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 77,
    "url_id": "pluto",
    "name": "Pluto",
    "short_description": "Mickey's loyal dog companion, a golden retriever mix known for his expressive face, playful personality, and unwavering devotion to his owner.",
    "long_description": "Pluto is Mickey Mouse's loyal and beloved dog, a golden retriever/bloodhound mix with expressive black ears and a red collar. Unlike other Disney animals who can talk, Pluto communicates through barks, whimpers, and facial expressions, making him incredibly expressive and relatable. He's incredibly loyal to Mickey and often gets into playful adventures or finds himself in comedic situations. Pluto's character represents the pure, unconditional love of a pet for its owner. His playful personality and ability to convey complex emotions without words have made him one of Disney's most enduring and beloved animal characters.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Disney Shorts",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pluto",
    "background_image_1": "s0_pluto",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 78,
    "url_id": "pocahontas",
    "name": "Pocahontas",
    "short_description": "The brave Native American princess who bridges two cultures, teaching about harmony with nature and the importance of understanding different perspectives.",
    "long_description": "Pocahontas is a brave and wise Native American princess of the Powhatan tribe, known for her deep connection to nature and her role in bridging two cultures. When English settlers arrive in Jamestown, Pocahontas becomes a mediator between her people and the newcomers, showing compassion and wisdom beyond her years. Her relationship with John Smith teaches her about different ways of life, while she teaches him about respecting nature and living in harmony with the land. Pocahontas represents cultural understanding, environmental stewardship, and the courage to stand up for what is right. Her story emphasizes the importance of empathy, communication, and finding common ground between different peoples.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Pocahontas",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pocahontas",
    "background_image_1": "s0_pocahontas",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 79,
    "url_id": "prince_snow_white",
    "name": "Prince (Snow White)",
    "short_description": "The charming prince who awakens Snow White with true love's kiss, representing the classic fairy tale hero and the power of love.",
    "long_description": "The Prince is Snow White's true love and the catalyst for breaking the Evil Queen's sleeping curse. Though he appears briefly in the story, singing to Snow White from her balcony and later awakening her with true love's kiss, his role is pivotal. The Prince represents the classic fairy tale hero - charming, noble, and devoted. His unwavering love for Snow White demonstrates the power of true love to overcome evil. Though he has limited screen time, his character embodies the romantic ideal and the belief that love conquers all, a cornerstone of fairy tale tradition.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Snow White and the Seven Dwarfs",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_snow_white",
    "background_image_1": "s0_snow_white",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 80,
    "url_id": "prince_charming",
    "name": "Prince Charming",
    "short_description": "The handsome prince who rescues Cinderella from her life of servitude, representing the fairy tale ideal of romantic heroism.",
    "long_description": "Prince Charming is the handsome, noble prince who falls in love with Cinderella at the royal ball and later searches for her with the help of the glass slipper. Though he plays a secondary role in the story, his determination to find the mysterious princess shows his romantic nature and belief in true love. Prince Charming represents the classic fairy tale prince - charming, devoted, and willing to go to great lengths for love. His story with Cinderella emphasizes that true love sees beyond surface appearances and social status, focusing instead on inner beauty and character.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cinderella",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_prince_charming",
    "background_image_1": "s0_prince_charming",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 81,
    "url_id": "prince_eric",
    "name": "Prince Eric",
    "short_description": "The kind-hearted prince of a seaside kingdom who falls in love with Ariel, showing compassion and bravery in the face of danger.",
    "long_description": "Prince Eric is the compassionate and brave prince of a seaside kingdom who becomes enamored with Ariel after she saves his life. Despite not being able to speak to her directly, Eric shows kindness and determination in his search for the mysterious girl who saved him. His relationship with Ariel demonstrates that love can transcend barriers and differences. Eric represents traditional fairy tale heroism combined with modern sensitivity, showing bravery in battle against Ursula while maintaining his gentle, caring nature. His story with Ariel emphasizes the importance of communication, understanding, and acceptance in relationships.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Little Mermaid",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_prince_eric",
    "background_image_1": "s0_prince_eric",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 82,
    "url_id": "pua",
    "name": "Pua",
    "short_description": "Moana's loyal pig companion who provides comfort and friendship during her ocean voyage, representing loyalty and home.",
    "long_description": "Pua is Moana's loyal and affectionate pet pig who accompanies her on her journey across the ocean. Though he stays behind on the island when Moana sets sail, Pua represents the comfort of home and the importance of family bonds. His gentle nature and devotion to Moana highlight themes of loyalty, love, and the emotional support that helps us face our fears. Despite his small size and simple nature, Pua shows courage and provides comic relief. He symbolizes the idea that true strength comes from love and that even the smallest companions can make the biggest difference in our lives.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Moana",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pua",
    "background_image_1": "s0_pua",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 83,
    "url_id": "pumbaa",
    "name": "Pumbaa",
    "short_description": "The warm-hearted warthog who adopts Simba and Timon, teaching about acceptance and the importance of family and friendship.",
    "long_description": "Pumbaa is a kind-hearted, laid-back warthog who lives by the philosophy 'hakuna matata' (no worries). After being adopted by Timon as a cub, Pumbaa becomes part of their 'meerkat and warthog' family and later welcomes Simba into their home. Despite his large size and appearance, Pumbaa is gentle, loyal, and always ready with a warm welcome. His famous belch and love of grubs provide comic relief, but his wisdom and compassion shine through in his relationships with Timon and Simba. Pumbaa represents acceptance, friendship, and the idea that family is about who you choose to love, not just blood relations.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Lion King",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_pumbaa",
    "background_image_1": "s0_pumbaa",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 84,
    "url_id": "queen_of_hearts",
    "name": "Queen of Hearts",
    "short_description": "The tyrannical ruler of Wonderland who is obsessed with her rose garden and known for her explosive temper and 'Off with their heads!' decree.",
    "long_description": "The Queen of Hearts is the tyrannical ruler of Wonderland, known for her explosive temper, love of croquet, and obsession with her rose garden. Her famous catchphrase 'Off with their heads!' reflects her cruel and impulsive nature, where she orders executions for the slightest offenses. Despite her fearsome reputation, the Queen is ultimately a figure of absurdity in Wonderland's topsy-turvy world. She represents unchecked power, the dangers of tyranny, and the ridiculousness of authority figures who abuse their power. Her character serves as a warning about the corrupting influence of absolute power and the importance of justice and mercy.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Alice in Wonderland",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_queen_of_hearts",
    "background_image_1": "s0_queen_of_hearts",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 85,
    "url_id": "rapunzel",
    "name": "Rapunzel",
    "short_description": "The long-haired princess locked in a tower who discovers her true identity and the power of her hair, embarking on a journey of self-discovery.",
    "long_description": "Rapunzel is a princess with magical long hair that has the power to heal and reverse aging, locked away in a tower by her overprotective mother Gothel. Despite living an isolated life, Rapunzel maintains an optimistic and curious personality, filling her days with painting, reading, and dreaming of the outside world. When she meets Flynn Rider, she embarks on an adventure that leads to self-discovery and reuniting with her true family. Rapunzel represents curiosity, creativity, and the journey from dependence to independence. Her story emphasizes the importance of following one's dreams, discovering one's true potential, and the healing power of love and family.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Tangled",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_rapunzel",
    "background_image_1": "s0_rapunzel",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 86,
    "url_id": "rolly",
    "name": "Rolly",
    "short_description": "One of the 101 Dalmatians puppies, known for his playful personality and distinctive markings.",
    "long_description": "Rolly is one of the 101 Dalmatian puppies born to Pongo and Perdita. Known for his love of food and playful nature, Rolly is always hungry and often gets into mischief looking for snacks. Despite his gluttonous tendencies, Rolly is loyal and loving toward his family. His distinctive markings and personality make him memorable among the large litter of puppies. Rolly represents the joy of childhood, the importance of family bonds, and the idea that every individual has their own unique personality and interests, even within a large family.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "101 Dalmatians",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_rolly",
    "background_image_1": "s0_rolly",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 87,
    "url_id": "sally",
    "name": "Sally",
    "short_description": "The rag doll girlfriend of Jack Skellington who tries to save Christmas and represents love and wisdom in Halloween Town.",
    "long_description": "Sally is a rag doll created by Dr. Finkelstein, girlfriend of Jack Skellington, and the voice of reason in Halloween Town. Made from various pieces of cloth and stitched together, Sally has the ability to create potions and predict the future. Despite her quiet nature, Sally shows great courage and wisdom, warning Jack about the dangers of his Christmas obsession. Her love for Jack and concern for Halloween Town drive her to save Christmas. Sally represents quiet strength, wisdom, and the power of love to guide others. Her character shows that true beauty comes from within and that even the most unassuming individuals can make a profound difference.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cars",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sally",
    "background_image_1": "s0_sally",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 88,
    "url_id": "scrump",
    "name": "Scrump",
    "short_description": "One of the 101 Dalmatians puppies, a playful and adventurous member of the litter.",
    "long_description": "Scrump is one of the 101 Dalmatian puppies, known for his playful and adventurous spirit. As part of the large litter born to Pongo and Perdita, Scrump represents the joy and energy of puppyhood. His distinctive spotted coat and mischievous personality make him stand out among his siblings. Scrump's adventures with his brothers and sisters highlight the importance of family bonds and the excitement of growing up in a loving home. Though he doesn't have a major individual storyline, Scrump contributes to the overall charm and appeal of the Dalmatian family.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_scrump",
    "background_image_1": "s0_scrump",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 89,
    "url_id": "sebastian",
    "name": "Sebastian",
    "short_description": "King Triton's loyal crab composer and court musician who tries to keep Ariel out of trouble while organizing underwater performances.",
    "long_description": "Sebastian is King Triton's loyal court composer and musician, a red Jamaican crab with a distinctive Caribbean accent. As Ariel's self-appointed guardian, Sebastian tries to keep the princess out of trouble while fulfilling his duties as the conductor of Atlantica's musical performances. Despite his nervousness and tendency to worry, Sebastian shows great loyalty to the royal family and bravery when needed. His famous song 'Under the Sea' captures his love of music and the beauty of ocean life. Sebastian represents duty, creativity, and the challenges of balancing responsibility with personal passions.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Little Mermaid",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sebastian",
    "background_image_1": "s0_sebastian",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 90,
    "url_id": "simba",
    "name": "Simba",
    "short_description": "The young lion cub destined to become king of the Pride Lands, learning about responsibility, courage, and the circle of life after being betrayed by his uncle Scar.",
    "long_description": "Simba is the son of King Mufasa and Queen Sarabi, heir to the throne of the Pride Lands. As a playful cub, he is best friends with Nala and mentored by his wise father. His life is shattered when his jealous uncle Scar murders Mufasa and convinces Simba that he is responsible for his father's death. Filled with guilt and fear, Simba flees the Pride Lands and lives a carefree life with Timon and Pumbaa. Years later, he encounters his childhood friend Nala and learns that Scar has destroyed the kingdom. With the help of Rafiki and his friends, Simba returns to challenge Scar and reclaim his rightful place as king. Simba's journey represents personal growth, facing one's fears, and understanding the importance of responsibility and leadership.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Lion King",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_simba",
    "background_image_1": "s0_simba",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 91,
    "url_id": "skylar",
    "name": "Skylar",
    "short_description": "One of the 101 Dalmatians puppies, a sweet and gentle member of the large litter.",
    "long_description": "Skylar is one of the 101 Dalmatian puppies born to Pongo and Perdita. Known for her sweet and gentle nature, Skylar represents the quieter, more observant members of the large puppy family. Her distinctive markings and calm personality make her stand out among her more boisterous siblings. Skylar's presence in the story emphasizes the diversity within families and the idea that every individual has their own unique temperament and contributions. Though she doesn't have major individual plotlines, Skylar contributes to the overall warmth and charm of the Dalmatian family narrative.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Doc McStuffins",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_skylar",
    "background_image_1": "s0_skylar",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 92,
    "url_id": "snow_white",
    "name": "Snow White",
    "short_description": "The kind and gentle princess who takes refuge with seven dwarfs, teaching about kindness, optimism, and the triumph of good over evil.",
    "long_description": "Snow White is Disney's first princess, a kind and optimistic young woman forced to flee her home after her jealous stepmother, the Evil Queen, tries to have her killed. Taking refuge with seven kindly dwarfs, Snow White brings joy and cleanliness to their cottage while evading the Queen's murderous plots. Despite the dangers she faces, Snow White maintains her gentle nature and belief in goodness. Her story culminates in being awakened by true love's kiss from her prince. Snow White represents innocence, kindness, and the power of optimism. She established the template for Disney princesses and continues to inspire with her message that goodness and love ultimately triumph over evil.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Snow White and the Seven Dwarfs",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_snow_white",
    "background_image_1": "s0_snow_white",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 93,
    "url_id": "stitch",
    "name": "Stitch",
    "short_description": "A mischievous alien experiment created by Dr. Jumba, who learns about love and family while causing chaos on Earth with his adopted sister Lilo.",
    "long_description": "Stitch is Experiment 626, a small, blue, koala-like alien created by the evil scientist Dr. Jumba Jookiba. Designed to be the ultimate weapon, Stitch was meant to destroy everything he touched. However, after crash-landing on Earth, he is adopted by the young Hawaiian girl Lilo, who names him Stitch. Initially destructive and mischievous, Stitch gradually learns about love, family, and friendship through his relationship with Lilo. His journey from villainous experiment to beloved family member is marked by his catchphrase 'Ih!' and his love of Elvis Presley. Stitch represents redemption, the power of love to change even the most destructive beings, and the importance of family bonds.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Lilo & Stitch",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_stitch",
    "background_image_1": "s0_stitch",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 94,
    "url_id": "sven",
    "name": "Sven",
    "short_description": "Kristoff's loyal reindeer companion who provides comic relief and shows the deep bond between humans and animals.",
    "long_description": "Sven is Kristoff's loyal and affectionate reindeer companion who lives with him in the mountains of Arendelle. Though he cannot speak, Sven communicates through expressive facial expressions and actions, showing intelligence and personality. His relationship with Kristoff demonstrates the deep bonds that can form between humans and animals. Sven provides comic relief with his playful antics and love of carrots, but he also shows bravery and loyalty during dangerous situations. He represents the joy of companionship, the intelligence of animals, and the idea that love and friendship transcend species boundaries.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Frozen",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sven",
    "background_image_1": "s0_sven",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 95,
    "url_id": "thumper",
    "name": "Thumper",
    "short_description": "Bambi's cheerful rabbit friend who loves to thump his foot and provides comic relief with his energetic personality.",
    "long_description": "Thumper is Bambi's cheerful and energetic rabbit friend, known for his habit of thumping his hind foot when excited or emphasizing a point. As a young rabbit, Thumper is playful, talkative, and always ready for adventure. Despite his small size, Thumper shows bravery and loyalty to his friends. His famous line 'If you can't say something nice, don't say nothing at all' reflects his straightforward and honest nature. Thumper represents youthful energy, friendship, and the importance of thinking before speaking. His relationship with Bambi highlights the joy of childhood friendships and the bonds formed in nature.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Bambi",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_thumper",
    "background_image_1": "s0_thumper",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 96,
    "url_id": "tiana",
    "name": "Tiana",
    "short_description": "A hardworking waitress with big dreams of owning her own restaurant, learning that there's room for both work and love in life.",
    "long_description": "Tiana is a hardworking young woman in 1920s New Orleans who dreams of owning her own restaurant. Working multiple jobs as a waitress, Tiana saves every penny toward her goal while caring for her father. When she meets Prince Naveen, Tiana initially sees him as an obstacle to her dreams, but gradually learns that there's room for both love and ambition in life. Her journey involves magic, music, and self-discovery as she transforms from a frog back to human form. Tiana represents determination, cultural heritage, and the American Dream. She breaks stereotypes by being a princess who achieves her goals through hard work rather than marriage, emphasizing that women can have both successful careers and loving relationships.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Princess and the Frog",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_tiana",
    "background_image_1": "s0_tiana",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 97,
    "url_id": "tigger",
    "name": "Tigger",
    "short_description": "The bouncy, energetic tiger from the Hundred Acre Wood who loves to bounce and exclaim 'The wonderful thing about Tiggers is I'm the only one!'",
    "long_description": "Tigger is a energetic, bouncy tiger who lives in the Hundred Acre Wood with Winnie the Pooh and his friends. Known for his boundless energy and love of bouncing, Tigger is always ready for adventure and fun. His signature catchphrase 'The wonderful thing about Tiggers is I'm the only one!' reflects his confident, self-assured personality. Despite his hyperactivity, Tigger has a good heart and cares deeply about his friends. He often gets into trouble due to his impulsive nature but always tries to make things right. Tigger represents enthusiasm, confidence, and the joy of living life to the fullest. His bouncy personality and striped fur make him one of the most recognizable characters in the Pooh universe.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Winnie the Pooh",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_tigger",
    "background_image_1": "s0_tigger",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 98,
    "url_id": "timon",
    "name": "Timon",
    "short_description": "The wise-cracking meerkat who adopts Simba and teaches him the carefree philosophy of 'Hakuna Matata' (no worries).",
    "long_description": "Timon is a wise-cracking meerkat who lives by the philosophy 'Hakuna Matata' (no worries). After leaving the lion pride where he faced constant danger, Timon adopts a carefree lifestyle with his warthog friend Pumbaa. When they find the young Simba, Timon and Pumbaa take him in and teach him their relaxed way of life. Despite his small size and sarcastic personality, Timon shows great loyalty and bravery when his friends need him. His relationship with Pumbaa demonstrates the power of chosen family and friendship. Timon represents living in the moment, overcoming fear, and the idea that true happiness comes from within.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Lion King",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_timon",
    "background_image_1": "s0_timon",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 99,
    "url_id": "tinker_bell",
    "name": "Tinker Bell",
    "short_description": "Peter Pan's loyal fairy companion, a tiny winged pixie known for her feisty personality, magical abilities, and green glow when she's happy.",
    "long_description": "Tinker Bell is a tiny fairy and Peter Pan's loyal companion in Neverland. With her pixie dust that allows others to fly and her magical abilities, Tinker Bell is both helpful and mischievous. Her green glow indicates when she's feeling happy or content, while a red glow shows anger or jealousy. Though she can't speak (communicating only in bells and fairy dust), her expressive face and actions convey a wide range of emotions. Tinker Bell is fiercely protective of Peter and often jealous of his attention to Wendy. Her character represents loyalty, the magic of belief, and the power of friendship. As one of Disney's most iconic fairies, Tinker Bell has inspired generations of children to believe in magic and the power of imagination.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Peter Pan",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_tinker_bell",
    "background_image_1": "s0_tinker_bell",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 100,
    "url_id": "uma",
    "name": "Uma",
    "short_description": "The fierce daughter of Ursula who leads the villain kids and struggles with her mother's legacy while seeking her own path.",
    "long_description": "Uma is the fierce and ambitious daughter of the sea witch Ursula, raised on the Isle of the Lost with the other villain kids. As the leader of the group, Uma is determined, strong-willed, and struggles with her mother's dark legacy. She initially sees Mal as a rival but gradually develops respect for her. Uma's character explores themes of breaking free from parental expectations, finding one's own identity, and the possibility of redemption. Despite her tough exterior and villainous background, Uma shows vulnerability and a desire for acceptance. She represents the complexity of growing up with a difficult family legacy and the courage to forge one's own path.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Descendants",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_uma",
    "background_image_1": "s0_uma",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 101,
    "url_id": "ursula",
    "name": "Ursula",
    "short_description": "The scheming sea witch who trades voices for legs, manipulating Ariel's desires to gain power over Atlantica and become its ruler.",
    "long_description": "Ursula is a powerful sea witch and the main antagonist in The Little Mermaid. Banished from Atlantica by King Triton for her use of dark magic, Ursula lives in a cavern filled with her collection of cursed objects. She offers to help Ariel become human in exchange for her voice, planning to use the deal to overthrow Triton and rule the seas. Ursula's character is defined by her ambition, cunning, and love of theatricality. She represents the dangers of unchecked ambition and the corrupting influence of power. Despite her villainous nature, Ursula is one of Disney's most memorable and charismatic villains, known for her distinctive appearance, voice, and the iconic song 'Poor Unfortunate Souls.'",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Little Mermaid",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_ursula",
    "background_image_1": "s0_ursula",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 102,
    "url_id": "white_rabbit",
    "name": "White Rabbit",
    "short_description": "The anxious time-obsessed rabbit who is always late and serves as Alice's guide through the chaotic world of Wonderland.",
    "long_description": "The White Rabbit is a nervous, time-obsessed rabbit who is perpetually late and serves as Alice's initial guide into Wonderland. Dressed in a waistcoat and carrying a pocket watch, he represents the strict adherence to schedules and social expectations of Victorian England. His constant exclamation 'Oh dear! Oh dear! I shall be too late!' reflects his anxiety and importance placed on punctuality. Despite his frazzled nature, the White Rabbit shows moments of kindness and helps Alice navigate Wonderland's madness. He represents the absurdity of rigid societal norms and the stress of modern life, providing comic relief while highlighting themes of time management and adaptation to chaos.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Alice in Wonderland",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_white_rabbit",
    "background_image_1": "s0_white_rabbit",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 103,
    "url_id": "winnie_the_pooh",
    "name": "Winnie the Pooh",
    "short_description": "A gentle, honey-loving bear who lives in the Hundred Acre Wood, known for his simple wisdom, love of food, and adventures with his friends.",
    "long_description": "Winnie the Pooh is a friendly, honey-loving bear who lives in the Hundred Acre Wood. Based on A.A. Milne's beloved children's books, Pooh is known for his slow, thoughtful manner of speaking and his love of 'hunny.' Despite his simple-mindedness, Pooh often displays profound wisdom and kindness. He lives in a house built into an oak tree and spends his days going on adventures with his friends Christopher Robin, Piglet, Tigger, Eeyore, Rabbit, Owl, and Kanga. Pooh's philosophy of life is simple: enjoy the little things, be kind to others, and always have a little smackerel of something to eat. His character represents innocence, friendship, and the joy of simple pleasures.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Winnie the Pooh",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_winnie_the_pooh",
    "background_image_1": "s0_winnie_the_pooh",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 104,
    "url_id": "zero",
    "name": "Zero",
    "short_description": "Oogie Boogie's ghostly dog companion who provides eerie illumination and represents the spooky side of Halloween.",
    "long_description": "Zero is Oogie Boogie's loyal ghost dog, a skeletal canine with a glowing pumpkin nose that provides eerie illumination. As Oogie Boogie's faithful companion, Zero embodies the spooky, supernatural elements of Halloween. Despite his frightening appearance, Zero shows loyalty and affection toward his master. His glowing nose serves both practical and thematic purposes, lighting dark spaces while symbolizing the mysterious and otherworldly aspects of Halloween. Zero represents the playful scariness of Halloween traditions and the idea that even frightening things can be endearing. His relationship with Oogie Boogie highlights themes of loyalty and the bonds that can form between the most unlikely characters.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Nightmare Before Christmas",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_zero",
    "background_image_1": "s0_zero",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 105,
    "url_id": "ant_man",
    "name": "Ant-Man",
    "short_description": "A brilliant inventor and thief who uses Pym Particles to shrink to the size of an ant, becoming a hero to protect his daughter.",
    "long_description": "Scott Lang, also known as Ant-Man, is a brilliant inventor and former thief who discovers Dr. Hank Pym's revolutionary Pym Particles. These particles allow him to shrink to the size of an ant while retaining his normal strength, making him capable of incredible feats. Initially using his powers for personal gain, Scott becomes a hero when he learns that his actions affect his young daughter Cassie. He joins the Avengers to protect the world and his family, proving that even someone with a criminal past can become a true hero. Ant-Man's intelligence, quick thinking, and determination make him an invaluable member of any team.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 106,
    "url_id": "black_panther",
    "name": "Black Panther",
    "short_description": "The king of Wakanda, a technologically advanced African nation, who uses his enhanced suit and vibranium to protect his people and the world.",
    "long_description": "T'Challa, the Black Panther, is the king of Wakanda, the most technologically advanced nation on Earth. As the protector of Wakanda, he wears a suit made of vibranium that enhances his strength, speed, and durability. T'Challa is a brilliant scientist, strategist, and warrior who has been trained in combat since childhood. Initially wary of the outside world, he learns that isolationism is not the answer when his father is killed. T'Challa becomes a global hero, fighting alongside the Avengers while protecting Wakanda's secrets. His intelligence, leadership, and sense of justice make him one of the world's greatest heroes.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_black_panther",
    "background_image_1": "s0_black_panther",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 107,
    "url_id": "black_widow",
    "name": "Black Widow",
    "short_description": "A highly skilled spy and assassin trained by the Russian government, who becomes an Avenger and fights for justice despite her dark past.",
    "long_description": "Natasha Romanoff, known as Black Widow, is one of the world's most skilled spies and assassins. Trained from childhood by the Russian government as part of the Red Room program, Natasha was conditioned to be a perfect weapon. Despite her deadly skills in martial arts, marksmanship, and espionage, Natasha breaks free from her handlers and becomes a hero. She joins S.H.I.E.L.D. and the Avengers, using her expertise to protect the world. Natasha's journey is one of redemption as she confronts her past traumas and forms genuine relationships with her fellow heroes. Her intelligence, combat prowess, and moral compass make her an invaluable ally in the fight against evil.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_black_widow",
    "background_image_1": "s0_black_widow",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 108,
    "url_id": "captain_america",
    "name": "Captain America",
    "short_description": "A super-soldier enhanced by an experimental serum, who fights for freedom, justice, and the American way as the leader of the Avengers.",
    "long_description": "Steve Rogers, Captain America, is the living embodiment of patriotism and heroism. A frail young man during World War II, Steve volunteers for an experimental super-soldier serum that enhances his strength, speed, endurance, and healing abilities. Frozen in ice for decades, he awakens in the modern world and becomes a symbol of hope. Captain America leads the Avengers with unwavering moral conviction, always fighting for what's right even when it's difficult. His shield, made of vibranium, is both a weapon and a symbol of his unyielding defense of freedom. Steve's courage, leadership, and sense of justice inspire everyone around him to be better.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_america",
    "background_image_1": "s0_captain_america",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 109,
    "url_id": "captain_marvel",
    "name": "Captain Marvel",
    "short_description": "A powerful alien warrior with cosmic energy abilities, who discovers her human origins and becomes one of the universe's greatest heroes.",
    "long_description": "Carol Danvers, Captain Marvel, is one of the most powerful beings in the universe. Originally a human Air Force pilot, Carol gains incredible abilities after exposure to alien technology and energy. She can fly at supersonic speeds, project energy blasts, and has superhuman strength and durability. Carol's journey of self-discovery leads her to learn about her alien heritage and her role as a protector of the universe. As a member of the Avengers and a leader in her own right, Captain Marvel represents strength, independence, and the power of embracing one's true potential. Her confidence and determination make her an inspiration to all who fight for justice.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_marvel",
    "background_image_1": "s0_captain_marvel",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 110,
    "url_id": "doctor_strange",
    "name": "Doctor Strange",
    "short_description": "A brilliant surgeon turned mystical master of the arcane arts, who protects Earth from supernatural threats using magic and the Time Stone.",
    "long_description": "Dr. Stephen Strange, Doctor Strange, is a brilliant neurosurgeon whose career is destroyed in a car accident. Desperate to heal his hands, he travels to Tibet and becomes the apprentice of the Ancient One, learning the mystic arts. As the Sorcerer Supreme, Doctor Strange protects Earth from supernatural threats using powerful spells, dimensional travel, and artifacts like the Eye of Agamotto containing the Time Stone. His arrogance gives way to wisdom and humility as he embraces his role as a guardian. Doctor Strange represents the power of intellect combined with spirituality, showing that true strength comes from within and that there are forces beyond scientific understanding.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_doctor_strange",
    "background_image_1": "s0_doctor_strange",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 111,
    "url_id": "drax",
    "name": "Drax",
    "short_description": "A literal-minded alien warrior seeking revenge against Thanos for destroying his family, known for his combat skills and straightforward personality.",
    "long_description": "Drax the Destroyer is a powerful alien warrior from a race destroyed by Thanos. After Thanos kills his wife and daughter, Drax is rebuilt as a cybernetic being with enhanced strength and durability, programmed specifically to kill Thanos. His literal-minded nature often leads to humorous misunderstandings, but his combat skills and determination make him a formidable ally. Drax joins the Guardians of the Galaxy, learning that revenge isn't the only path to justice. His journey shows the healing power of friendship and finding purpose beyond vengeance. Drax represents raw power combined with unexpected wisdom and the importance of chosen family.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Guardians of the Galaxy",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_drax",
    "background_image_1": "s0_drax",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 112,
    "url_id": "gamora",
    "name": "Gamora",
    "short_description": "A deadly assassin raised by Thanos as his adopted daughter, who becomes a hero fighting against her father's tyranny alongside the Guardians of the Galaxy.",
    "long_description": "Gamora is a skilled assassin and warrior raised by the tyrannical Thanos as his adopted daughter. Trained to be the perfect weapon, Gamora becomes Thanos' favorite child and most deadly enforcer. Despite her lethal skills and stoic demeanor, Gamora has a strong moral compass and eventually rebels against her father. She joins the Guardians of the Galaxy, forming genuine bonds of friendship and finding redemption. Gamora's complex relationship with her sister Nebula and her struggle between her dark past and desire for a better future make her one of the most compelling characters in the Marvel universe. She represents the possibility of breaking free from abusive upbringing and choosing one's own path.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Guardians of the Galaxy",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_gamora",
    "background_image_1": "s0_gamora",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 113,
    "url_id": "green_goblin",
    "name": "Green Goblin",
    "short_description": "A brilliant but insane businessman who becomes Spider-Man's arch-nemesis, using goblin formula-enhanced technology to terrorize New York City.",
    "long_description": "Norman Osborn, the Green Goblin, is a brilliant industrialist and businessman who experiments with a dangerous goblin formula that enhances his strength and intellect but drives him insane. As the Green Goblin, he becomes Spider-Man's most dangerous foe, using advanced technology, pumpkin bombs, and a goblin glider to commit crimes and try to destroy the web-slinger. His dual personality - the respectable businessman by day and the maniacal villain by night - makes him unpredictable and terrifying. The Green Goblin represents the corrupting influence of power and the darkness that can lurk within seemingly successful people. His complex relationship with Spider-Man adds depth to their eternal struggle.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Spider-Man",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_green_goblin",
    "background_image_1": "s0_green_goblin",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 114,
    "url_id": "groot",
    "name": "Groot",
    "short_description": "A tree-like alien warrior who communicates mainly with 'I am Groot,' protecting his friends with incredible strength and unwavering loyalty.",
    "long_description": "Groot is a tree-like alien from Planet X, known for his incredible strength, regenerative abilities, and limited vocabulary consisting mainly of 'I am Groot.' Despite his simple speech, Groot is highly intelligent and deeply loyal to his friends. He joins the Guardians of the Galaxy as a protector, using his ability to grow and manipulate his wooden form in battle. Groot's child-like innocence and willingness to sacrifice himself for others make him beloved by fans. His famous line 'I am Groot' has become a cultural phenomenon, representing the idea that actions speak louder than words. Groot shows that true friendship transcends language and species differences.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Guardians of the Galaxy",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_groot",
    "background_image_1": "s0_groot",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 115,
    "url_id": "hawkeye",
    "name": "Hawkeye",
    "short_description": "A master archer and marksman who fights alongside the Avengers, using his exceptional skill with a bow and arrows to take down threats.",
    "long_description": "Clint Barton, Hawkeye, is a master archer and one of the most skilled marksmen in the world. Orphaned as a child and trained in a circus, Clint becomes a S.H.I.E.L.D. agent and Avenger, using his incredible accuracy and specially designed arrows to take down enemies. Despite lacking superpowers, Hawkeye's determination, quick thinking, and combat skills make him an invaluable member of any team. His relationship with Black Widow shows deep friendship and trust. Hawkeye represents the idea that skill and training can equal superpowers, proving that ordinary people can achieve extraordinary things through dedication and practice.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_hawkeye",
    "background_image_1": "s0_hawkeye",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 116,
    "url_id": "hulk",
    "name": "Hulk",
    "short_description": "A brilliant scientist who transforms into a rage-fueled green giant with incredible strength when angered, representing the struggle between intellect and emotion.",
    "long_description": "Dr. Bruce Banner, the Hulk, is a brilliant scientist who becomes a victim of gamma radiation during an experiment gone wrong. When angered or stressed, he transforms into the Hulk - a massive, green-skinned monster with unlimited strength that grows with his rage. The Hulk represents the struggle between Banner's gentle, intellectual nature and the raw, destructive power of his alter ego. Despite his fearsome appearance and tendency to smash everything in sight, the Hulk has a child-like innocence and often protects the innocent. His internal conflict and search for control make him one of Marvel's most complex characters, exploring themes of anger management and the duality of human nature.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_hulk",
    "background_image_1": "s0_hulk",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 117,
    "url_id": "iron_man",
    "name": "Iron Man",
    "short_description": "A billionaire genius inventor who builds powered armor suits to fight crime and protect the world as the charismatic leader of the Avengers.",
    "long_description": "Tony Stark, Iron Man, is a billionaire genius inventor and CEO of Stark Industries who builds advanced powered armor suits to fight crime and protect the world. Originally a weapons manufacturer, Tony's life changes when he's captured by terrorists and builds his first suit to escape. His armor provides superhuman strength, flight, energy weapons, and advanced technology. Despite his arrogance and playboy lifestyle, Tony has a strong moral compass and becomes a founding member of the Avengers. His intelligence, wit, and determination make him both a technological innovator and a symbol of human potential. Tony represents the idea that technology, when used responsibly, can change the world for the better.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_iron_man",
    "background_image_1": "s0_iron_man",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 118,
    "url_id": "rocket_raccoon",
    "name": "Rocket Raccoon",
    "short_description": "A genetically enhanced raccoon with cybernetic implants, expert mechanic, and gunner who fights alongside the Guardians of the Galaxy with wit and firepower.",
    "long_description": "Rocket Raccoon is a genetically enhanced raccoon with cybernetic implants, making him highly intelligent, agile, and deadly with weapons. Created by illegal experiments, Rocket becomes a master mechanic and gunner, building and maintaining the Guardians' ship and weapons. His sarcastic wit and tough exterior hide deep-seated trust issues from his traumatic past. Despite his small size, Rocket is a formidable fighter and strategist. His friendship with Groot and the other Guardians shows his capacity for loyalty and love. Rocket represents resilience in the face of abuse and the idea that family can be found among the most unlikely companions. His catchphrase 'We're rich!' captures his opportunistic nature and love of adventure.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Guardians of the Galaxy",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 119,
    "url_id": "scarlet_witch",
    "name": "Scarlet Witch",
    "short_description": "A powerful mutant with reality-warping abilities who struggles to control her chaos magic while fighting for mutant rights and protecting her family.",
    "long_description": "Wanda Maximoff, the Scarlet Witch, is a powerful mutant with the ability to manipulate chaos magic and alter reality itself. Raised in a war-torn country and experimented on by HYDRA, Wanda discovers her incredible powers and joins the Avengers. Her abilities include telekinesis, energy projection, and reality manipulation, but she struggles to control them, often causing unintended consequences. Wanda's journey is one of trauma, loss, and redemption as she fights for mutant rights and protects her brother Pietro and later her children. Despite her immense power, Wanda represents the vulnerability of those who feel like outsiders and the struggle to find one's place in the world.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_scarlet_witch",
    "background_image_1": "s0_scarlet_witch",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 120,
    "url_id": "spider_man",
    "name": "Spider-Man",
    "short_description": "A teenage superhero with spider-like abilities who fights crime in New York City, balancing his heroic duties with the challenges of growing up.",
    "long_description": "Peter Parker, Spider-Man, is a teenage superhero who gains spider-like abilities after being bitten by a radioactive spider. With super strength, agility, wall-crawling, and spider-sense that warns him of danger, Peter becomes the web-slinging hero of New York City. Despite his powers, Peter struggles with the loss of his Uncle Ben, who taught him 'With great power comes great responsibility.' He balances his crime-fighting with school, work, and relationships, often dealing with the loneliness of being a hero. Spider-Man's youthful energy, quick wit, and determination make him relatable and inspiring. He represents the idea that anyone, even a teenager, can make a difference and that heroism is about character, not just power.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 121,
    "url_id": "star_lord",
    "name": "Star-Lord",
    "short_description": "A charismatic space adventurer and leader of the Guardians of the Galaxy, who uses his wit, charm, and mixtape to unite a team of misfits.",
    "long_description": "Peter Quill, Star-Lord, is a charismatic space adventurer and master thief who becomes the leader of the Guardians of the Galaxy. Abducted from Earth as a child after his mother's death, Peter grows up as a space outlaw, using his quick wit, charm, and impressive dance moves to survive. His collection of vintage Earth music and mixtapes becomes legendary among his crew. Despite his roguish exterior, Peter has a strong moral compass and forms deep bonds with his fellow Guardians. His leadership brings together a team of misfits - Gamora, Drax, Rocket, and Groot - to protect the galaxy. Star-Lord represents the power of optimism, friendship, and finding family in unexpected places.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Guardians of the Galaxy",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 122,
    "url_id": "thanos",
    "name": "Thanos",
    "short_description": "A powerful warlord obsessed with balancing the universe by wiping out half of all life, believing it's necessary for peace and resources.",
    "long_description": "Thanos is a powerful warlord from Titan who becomes obsessed with balancing the universe by eliminating half of all life. Believing that overpopulation leads to suffering and resource scarcity, Thanos collects the Infinity Stones to achieve his goal of 'balancing' the universe. His immense strength, strategic genius, and possession of all six Infinity Stones make him one of the most powerful beings in existence. Despite his genocidal plans, Thanos genuinely believes he's doing what's right for the universe. His complex philosophy and willingness to sacrifice everything for his vision make him a compelling villain. Thanos represents the danger of extremist ideologies and the corrupting influence of absolute power.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_thanos",
    "background_image_1": "s0_thanos",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 123,
    "url_id": "thor",
    "name": "Thor",
    "short_description": "The God of Thunder from Asgard, wielding the mighty hammer Mjolnir and protecting both the Nine Realms and Earth with his immense strength and bravery.",
    "long_description": "Thor Odinson is the God of Thunder from Asgard, son of Odin and heir to the throne of the Nine Realms. With his mighty hammer Mjolnir that only the worthy can lift, Thor commands lightning and storms, possessing superhuman strength, durability, and longevity. Initially arrogant and impulsive, Thor learns humility when he's stripped of his powers and exiled to Earth. He becomes a founding member of the Avengers, protecting both Asgard and Earth from threats. Thor's journey from spoiled prince to wise hero represents personal growth, the importance of family, and the balance between power and responsibility. His booming laughter, love of battle, and unwavering sense of honor make him one of the most beloved heroes in the Marvel universe.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Marvel Cinematic Universe",
    "category": "Marvel",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_thor",
    "background_image_1": "s0_thor",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 124,
    "url_id": "3_peas_in_a_pod",
    "name": "3 Peas-in-a-Pod",
    "short_description": "Three identical peas who are best friends and provide comic relief with their synchronized antics and playful personalities.",
    "long_description": "The 3 Peas-in-a-Pod are three identical green peas who are inseparable best friends. They move and speak in perfect synchronization, often finishing each other's sentences and reacting to situations in unison. Despite their identical appearance, each pea has a distinct personality that shines through in their interactions. They represent the joy of friendship and the idea that true friends are always there for each other, no matter what. Their synchronized movements and playful antics provide comic relief throughout the story, reminding us that sometimes the simplest friendships are the most meaningful.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 125,
    "url_id": "aliens",
    "name": "Aliens",
    "short_description": "The little green aliens who operate Pizza Planet, providing comic relief and showing that toys can be found in unexpected places.",
    "long_description": "The Aliens are three small green aliens who operate Pizza Planet, a miniature amusement park inside a claw machine. With their high-pitched voices and antennae, they provide comic relief throughout the Toy Story films. Despite their small size, they show bravery and loyalty to their friends. Their catchphrase 'The claw!' refers to their fear of the claw machine that nearly captured them. The Aliens represent the idea that friends can come from anywhere and that even the smallest characters can make a big impact. Their presence in the toy world shows that toys aren't just for children - they can be found in the most unexpected places.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_aliens",
    "background_image_1": "s0_aliens",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 126,
    "url_id": "anger",
    "name": "Anger",
    "short_description": "The hot-headed red emotion who protects Riley by getting angry when things aren't fair, learning that anger has its place but isn't always the answer.",
    "long_description": "Anger is the hot-headed, explosive red emotion who serves as one of Riley's core emotions in Headquarters. With his fiery temper and tendency to blow his top, Anger believes that getting angry is the best way to solve problems and make things fair. His catchphrase 'That's it! I'm done!' reflects his impatience and frustration. However, Anger learns that while anger can motivate action and protect against injustice, it's not always the most helpful emotion. His journey shows that all emotions have value and that anger, when controlled, can be a powerful force for positive change. Anger represents the human experience of righteous indignation and the challenge of managing strong emotions.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_anger",
    "background_image_1": "s0_anger",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 127,
    "url_id": "bailey",
    "name": "Bailey",
    "short_description": "A beluga whale who believes he has lost his echolocation ability, learning that his 'disability' is actually a gift that helps him see the world differently.",
    "long_description": "Bailey is a young beluga whale who lives at the Marine Life Institute and believes he has lost his ability to echolocate. Initially depressed and withdrawn, Bailey learns that his 'disability' actually allows him to see the world in a new way - he can see colors and details that other whales miss. His journey of self-discovery helps him find confidence and purpose. Bailey represents overcoming self-doubt, embracing differences, and discovering that what seems like a limitation can actually be a unique strength. His friendship with Destiny shows the importance of supportive relationships and believing in oneself.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Dory",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bailey",
    "background_image_1": "s0_bailey",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 128,
    "url_id": "bing_bong",
    "name": "Bing Bong",
    "short_description": "Riley's imaginary friend and former imaginary best friend, a cotton candy creature who represents childhood imagination and the pain of growing up.",
    "long_description": "Bing Bong is Riley's imaginary friend from her childhood, a pink cotton candy-like creature with a wagon and rocket-powered feet. As Riley's emotions change during her move, Bing Bong begins to fade from her memory, representing the loss of childhood innocence. Despite his cheerful exterior, Bing Bong carries deep sadness about being forgotten. His sacrifice to help Joy return to Headquarters shows selfless love and the bittersweet nature of growing up. Bing Bong represents the magic of childhood imagination and the emotional complexity of transitioning from child to adolescent. His story reminds us that while we must let go of some things as we grow, the joy they brought stays with us forever.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bing_bong",
    "background_image_1": "s0_bing_bong",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 129,
    "url_id": "bruce",
    "name": "Bruce",
    "short_description": "A great white shark who tries to overcome his instinct to eat fish, attending fish-friendly support groups and struggling with temptation.",
    "long_description": "Bruce is a great white shark who genuinely tries to be friends with fish despite his natural instincts. He attends support groups like Fish-Friendly Sharks Anonymous and uses positive affirmations like 'Fish are friends, not food.' However, the smell of blood sends him into a feeding frenzy, revealing the challenge of overcoming deeply ingrained instincts. Bruce represents the struggle between nature and nurture, the difficulty of changing harmful behaviors, and the importance of self-awareness. Despite his intimidating appearance, Bruce shows that even predators can try to be better and that change, while difficult, is possible with effort and support.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Nemo",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bruce",
    "background_image_1": "s0_bruce",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 130,
    "url_id": "bullseye",
    "name": "Bullseye",
    "short_description": "Woody's loyal horse from the Woody's Roundup show, a wise and gentle steed who communicates through expressive eyes and provides quiet strength.",
    "long_description": "Bullseye is Woody's loyal horse from the Woody's Roundup television show, known for his expressive eyes and gentle nature. Though he never speaks, Bullseye communicates volumes through his facial expressions and actions, showing wisdom and loyalty. His relationship with Woody demonstrates deep friendship and trust. Despite his quiet demeanor, Bullseye shows courage and determination when needed. He represents the power of silent communication, the strength of quiet confidence, and the beauty of steadfast loyalty. Bullseye's presence reminds us that not all heroes need to be loud or flashy - sometimes the most powerful strength comes from quiet resolve and unwavering friendship.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_bullseye",
    "background_image_1": "s0_bullseye",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 131,
    "url_id": "buzz_lightyear",
    "name": "Buzz Lightyear",
    "short_description": "A space ranger action figure who believes he's a real Space Ranger, bringing courage, leadership, and a sense of adventure to Andy's toy collection.",
    "long_description": "Buzz Lightyear is a high-tech space ranger action figure who believes he's a real Space Ranger from Star Command. With his laser arm, wings, and catchphrase 'To infinity and beyond!', Buzz represents courage, leadership, and the power of imagination. Initially arrogant and dismissive of the other toys, Buzz learns the value of friendship and teamwork. His journey from believing he's a real space ranger to accepting his role as a toy mirrors the transition from childhood fantasy to adult understanding. Buzz's unwavering sense of duty and heroic nature make him the natural leader of Andy's toys, inspiring them to be brave and work together.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_buzz_lightyear",
    "background_image_1": "s0_buzz_lightyear",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 132,
    "url_id": "carl",
    "name": "Carl",
    "short_description": "A widowed balloon salesman who fulfills his promise to his late wife by tying thousands of balloons to his house and flying to Paradise Falls.",
    "long_description": "Carl Fredricksen is a kind-hearted but grumpy old man who worked as a balloon salesman and dreamed of adventure with his wife Ellie. After Ellie's death, Carl becomes reclusive and grouchy, but his love for her keeps him going. When developers threaten to demolish his house, Carl ties thousands of balloons to it and flies away, fulfilling his promise to Ellie to visit Paradise Falls. Along the way, he meets Russell, a Wilderness Explorer, who helps him rediscover joy and purpose. Carl represents enduring love, the courage to pursue dreams even in old age, and the idea that it's never too late to find adventure and new friendships. His transformation from grumpy old man to joyful adventurer shows the healing power of human connection.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Up",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_carl",
    "background_image_1": "s0_carl",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 133,
    "url_id": "cruz_ramirez",
    "name": "Cruz Ramirez",
    "short_description": "A young trainer at the Rust-eze Racing Center who dreams of becoming a racer, helping Lightning McQueen rediscover his love for racing.",
    "long_description": "Cruz Ramirez is a young, enthusiastic trainer at the Rust-eze Racing Center who has big dreams of becoming a professional racer. Despite facing discrimination as a female Mexican-American car, Cruz pursues her passion with determination and skill. She becomes Lightning McQueen's trainer and helps him regain his confidence and love for racing. Cruz represents breaking stereotypes, pursuing dreams against the odds, and the importance of mentorship. Her journey shows that passion and perseverance can overcome prejudice and that everyone deserves a chance to follow their dreams. Cruz's energy and optimism inspire those around her to believe in themselves.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cars",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_cruz_ramirez",
    "background_image_1": "s0_cruz_ramirez",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 134,
    "url_id": "disgust",
    "name": "Disgust",
    "short_description": "The green emotion who protects Riley from gross or embarrassing situations, valuing style, appearance, and keeping things 'cool.'",
    "long_description": "Disgust is the sophisticated green emotion who focuses on protecting Riley from anything gross, embarrassing, or 'uncool.' With her stylish appearance and judgmental attitude, Disgust ensures Riley maintains proper hygiene and social standards. Her catchphrase 'This is gross!' reflects her aversion to anything unpleasant. While she can seem superficial, Disgust plays an important role in helping Riley navigate social situations and maintain self-respect. Her journey shows that while style and appearance matter, true friendship and authenticity are more important than being 'cool.' Disgust represents the human desire for social acceptance and the importance of maintaining personal standards.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_disgust",
    "background_image_1": "s0_disgust",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 135,
    "url_id": "dory",
    "name": "Dory",
    "short_description": "A friendly blue tang fish with short-term memory loss who brings optimism, humor, and unwavering loyalty to her ocean adventures.",
    "long_description": "Dory is a vibrant blue tang fish with severe short-term memory loss, but whose optimism and cheerful personality make her unforgettable. Despite forgetting things almost immediately, Dory's kind heart and determination never waver. Her famous line 'Just keep swimming' has become an inspirational mantra for perseverance. Dory's journey to find her family while helping Marlin find Nemo shows that true friendship transcends memory and that courage comes from the heart. Her playful personality and ability to find joy in every situation make her a beloved character who teaches us that it's okay to be different and that everyone has something special to offer.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Nemo",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_dory",
    "background_image_1": "s0_dory",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 136,
    "url_id": "dug",
    "name": "Dug",
    "short_description": "A friendly golden retriever with a special collar that allows him to speak, bringing joy and loyalty to Carl and Russell's adventure.",
    "long_description": "Dug is a friendly golden retriever who wears a special collar that translates his thoughts into speech. Despite being trained as an attack dog by his former owner, Dug's naturally friendly and enthusiastic personality shines through. His catchphrase 'I have just met you, and I love you!' reflects his instantly affectionate nature. Dug joins Carl and Russell on their adventure, providing comic relief with his naive optimism and unwavering loyalty. He represents the pure joy of canine friendship, the importance of seeing beyond first impressions, and the healing power of unconditional love. Dug's presence reminds us that sometimes the most dangerous-looking creatures are actually the most loving.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Up",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_dug",
    "background_image_1": "s0_dug",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 137,
    "url_id": "edna_mode",
    "name": "Edna Mode",
    "short_description": "A brilliant fashion designer and superhero costume creator known for her sharp wit, no-nonsense attitude, and legendary capes.",
    "long_description": "Edna Mode is a brilliant, eccentric fashion designer who creates costumes for superheroes. With her sharp wit, thick German accent, and no-nonsense attitude, Edna is both intimidating and endearing. She famously declares 'No capes!' after her designs led to the deaths of several supers. Edna's genius-level intellect and perfectionism make her the best in her field, but her social awkwardness and focus on work over relationships show her human side. Despite her gruff exterior, Edna cares deeply about her clients and takes pride in her work. She represents female empowerment, creativity, and the idea that brilliance often comes with eccentricity.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Incredibles",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_edna_mode",
    "background_image_1": "s0_edna_mode",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 138,
    "url_id": "eve",
    "name": "EVE",
    "short_description": "A sleek white probe robot sent to Earth to search for signs of life, who discovers love and purpose through her relationship with Wall-E.",
    "long_description": "EVE (Extraterrestrial Vegetation Evaluator) is a sleek, white probe robot sent to Earth by the human spaceship Axiom to search for signs of sustainable life. With her advanced scanning abilities and directive to find plant life, EVE is efficient and focused on her mission. When she meets Wall-E, she discovers emotions and companionship she never knew existed. Her journey from emotionless probe to loving partner represents the awakening of consciousness and the power of love to change even the most programmed beings. EVE shows that purpose can evolve beyond original directives and that connection with others brings meaning to existence. Her relationship with Wall-E demonstrates that love transcends programming and physical form.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "WALL-E",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_eve",
    "background_image_1": "s0_eve",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 139,
    "url_id": "fear",
    "name": "Fear",
    "short_description": "The anxious purple emotion who tries to protect Riley from danger by imagining worst-case scenarios, learning that some risks are worth taking.",
    "long_description": "Fear is the anxious, jittery purple emotion who constantly tries to protect Riley by imagining every possible worst-case scenario. With his shaky hands and tendency to panic, Fear believes that anticipating danger is the best way to stay safe. His catchphrase 'We should probably panic!' reflects his nervous nature. However, Fear learns that while caution is important, excessive fear can prevent growth and joy. His journey shows that facing fears, rather than avoiding them, leads to confidence and new experiences. Fear represents the human instinct for self-preservation and the challenge of balancing caution with courage. He teaches that some of life's best moments come from taking calculated risks.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_fear",
    "background_image_1": "s0_fear",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 140,
    "url_id": "hamm",
    "name": "Hamm",
    "short_description": "A wisecracking piggy bank who serves as the sarcastic voice of reason among Andy's toys, always ready with a clever quip or plan.",
    "long_description": "Hamm is a wisecracking piggy bank who serves as the sarcastic, street-smart member of Andy's toy collection. With his coin slot mouth and love of money-themed humor, Hamm provides comic relief while offering practical advice. Despite his tough exterior, Hamm shows loyalty and bravery when his friends need him. His relationship with the other toys demonstrates that even the most cynical characters can have a heart of gold. Hamm represents the value of humor in difficult situations and the idea that wisdom often comes wrapped in sarcasm. His presence reminds us that not all advice needs to be serious to be valuable.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_hamm",
    "background_image_1": "s0_hamm",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 141,
    "url_id": "jack_jack",
    "name": "Jack-Jack",
    "short_description": "The youngest member of the Parr family with unpredictable superpowers, bringing chaos and joy as he discovers his abilities.",
    "long_description": "Jack-Jack Parr is the youngest child of Helen and Bob Parr, a seemingly ordinary baby who develops a wide array of unpredictable superpowers. From laser eyes to teleportation to turning into a demonic monster, Jack-Jack's abilities manifest in chaotic and hilarious ways. Despite his destructive tendencies, Jack-Jack is a loving baby who brings joy to his family. His journey represents the challenges of parenting gifted children and the wonder of discovering hidden potential. Jack-Jack shows that even the smallest family members can have the biggest impact and that superpowers don't diminish the need for love and family bonds.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Incredibles",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 142,
    "url_id": "jackson_storm",
    "name": "Jackson Storm",
    "short_description": "A cocky next-generation race car who represents the future of racing, learning that experience and heart matter more than technology.",
    "long_description": "Jackson Storm is a sleek, high-tech race car who represents the cutting edge of automotive technology. With his advanced design and superior speed, Jackson initially believes he's the future of racing and looks down on older cars like Lightning McQueen. However, he learns that racing isn't just about technology - it's about heart, experience, and the love of the sport. Jackson's journey shows the importance of respecting tradition while embracing innovation. He represents the balance between technological advancement and the timeless values of sportsmanship and perseverance. Jackson's character arc demonstrates that true greatness comes from within, not from external enhancements.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cars",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jackson_storm",
    "background_image_1": "s0_jackson_storm",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 143,
    "url_id": "jessie",
    "name": "Jessie",
    "short_description": "A spunky cowgirl doll from Woody's Roundup who overcomes abandonment issues to become a beloved member of Andy's toy family.",
    "long_description": "Jessie is a spunky, energetic cowgirl doll from the Woody's Roundup television show, known for her yodeling and adventurous spirit. Having been abandoned by her original owner Emily, Jessie struggles with trust issues and fear of being forgotten. Her journey with Woody and the other toys helps her overcome her past traumas and find a new family. Jessie's catchphrase 'Yee-haw!' reflects her enthusiastic personality. She represents resilience in the face of abandonment, the healing power of friendship, and the idea that it's never too late to find love and belonging. Jessie's relationship with Woody shows that even old wounds can heal with time and care.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jessie",
    "background_image_1": "s0_jessie",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 144,
    "url_id": "joy",
    "name": "Joy",
    "short_description": "The optimistic, energetic emotion who leads Riley's emotional headquarters, always striving to keep things positive and happy.",
    "long_description": "Joy is the bright, optimistic emotion who serves as the leader of Riley's emotional headquarters. With her golden hair and boundless energy, Joy is always trying to keep Riley happy and positive, often pushing other emotions aside to maintain control. Her journey through Riley's mind shows that all emotions, even sadness, have their place and purpose. Joy learns that true happiness comes from embracing all feelings, not just the positive ones. She represents the human desire for happiness and the realization that life's challenges help us grow. Joy's optimism and determination make her both relatable and inspiring, reminding us that it's okay to feel all emotions.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_joy",
    "background_image_1": "s0_joy",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 145,
    "url_id": "lightning_mcqueen",
    "name": "Lightning McQueen",
    "short_description": "A hot-shot race car who learns that winning isn't everything, discovering the value of friendship and community in the small town of Radiator Springs.",
    "long_description": "Lightning McQueen is a sleek red race car with the number 95, known for his incredible speed and cocky attitude. Initially obsessed with winning and fame, Lightning gets lost and ends up in the forgotten town of Radiator Springs, where he learns valuable lessons about friendship, humility, and the importance of community. With the help of Tow Mater and Doc Hudson, Lightning discovers that true success comes from loyalty and relationships, not just trophies. His journey from arrogant rookie to beloved champion represents personal growth and the realization that there's more to life than racing. Lightning's story teaches that everyone needs friends and that helping others is the real victory.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Cars",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_lightning_mcqueen",
    "background_image_1": "s0_lightning_mcqueen",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 146,
    "url_id": "merida",
    "name": "Merida",
    "short_description": "A headstrong Scottish princess who defies tradition to follow her own path, learning about family bonds and personal growth through her adventures.",
    "long_description": "Merida is a headstrong, independent princess of the Scottish kingdom of DunBroch, known for her fiery red hair, archery skills, and refusal to conform to traditional princess expectations. When she defies an ancient custom that would force her into an arranged marriage, Merida's actions unleash chaos that threatens her kingdom. Through her journey, she learns about the importance of family bonds, communication, and understanding different perspectives. Merida represents female empowerment, breaking stereotypes, and the courage to forge one's own destiny. Her relationship with her mother Elinor shows that change and growth are possible even in the closest relationships. Merida's story emphasizes that true strength comes from within and that tradition should evolve with the times.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Brave",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_merida",
    "background_image_1": "s0_merida",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 147,
    "url_id": "mike_wazowski",
    "name": "Mike Wazowski",
    "short_description": "A hardworking, one-eyed monster who is Sulley's best friend and roommate, bringing humor and determination to the scare floor at Monsters, Inc.",
    "long_description": "Mike Wazowski is a hardworking, one-eyed monster who is best friends and roommates with James P. Sullivan. Despite his small stature and lack of traditional scariness, Mike's determination and intelligence make him an excellent scarer at Monsters, Inc. His relationship with Sulley shows the power of friendship across differences, as Mike often provides comic relief with his sarcastic wit and schemes. Mike's journey teaches that true friendship transcends appearances and that everyone has unique talents to offer. His loyalty to Sulley and dedication to his job represent the value of hard work and believing in yourself, even when others doubt you.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Monsters, Inc.",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mike_wazowski",
    "background_image_1": "s0_mike_wazowski",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 148,
    "url_id": "mr_incredible",
    "name": "Mr. Incredible",
    "short_description": "A super-strong hero who tries to balance his crime-fighting past with family life, learning that being a father is his most important superpower.",
    "long_description": "Mr. Incredible (Bob Parr) is a super-strong hero with incredible strength and durability, formerly known as one of the world's greatest crime-fighters. After being forced into retirement and living as an ordinary insurance claims adjuster, Bob struggles with his desire to use his powers for good. His secret missions lead to family chaos, but ultimately help him realize that being a husband and father is his most important role. Bob represents the challenges of balancing career ambitions with family responsibilities, the frustration of unfulfilled potential, and the discovery that true heroism often happens at home. His journey shows that everyone has superpowers in their own way, and that family is worth fighting for.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Incredibles",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_mr_incredible",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 149,
    "url_id": "mrs_incredible",
    "name": "Mrs. Incredible",
    "short_description": "A super-stretchy heroine who juggles motherhood with heroism, proving that strength comes in many forms and family comes first.",
    "long_description": "Mrs. Incredible (Helen Parr) is a super-stretchy heroine with incredible elasticity and strength, formerly known as Elastigirl. After retiring from superhero life to raise a family, Helen struggles to balance her desire to help others with her responsibilities as a mother. Her journey shows that being a parent is a heroic endeavor in itself and that strength comes in many forms. Helen represents the challenges of modern motherhood, the importance of family bonds, and the idea that everyone has superpowers - some just require more patience and love than others. Her relationship with Bob shows that true partnership means supporting each other's dreams while putting family first.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Incredibles",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 150,
    "url_id": "nemo",
    "name": "Nemo",
    "short_description": "A brave clownfish with a small fin who embarks on an ocean-spanning adventure, learning about courage, friendship, and following his heart.",
    "long_description": "Nemo is a small clownfish with a deformed fin who lives in the Great Barrier Reef with his overprotective father Marlin. Despite his physical limitation, Nemo is brave, curious, and determined. When he's captured by a diver and taken to a fish tank in Sydney, Nemo must use his wits and courage to find his way home. His journey teaches him about independence, friendship, and the importance of believing in yourself. Nemo represents overcoming obstacles and the idea that our differences make us special. His relationship with his father shows the balance between parental protection and allowing children to grow, while his friendship with Dory demonstrates that true friends accept us for who we are.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Nemo",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_nemo",
    "background_image_1": "s0_nemo",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 151,
    "url_id": "rex",
    "name": "Rex",
    "short_description": "A gentle T-Rex toy who dreams of being fierce but is actually kind-hearted, representing that true strength comes from within.",
    "long_description": "Rex is a large, green Tyrannosaurus Rex toy who desperately wants to be scary and ferocious, but is actually one of the gentlest toys in Andy's collection. Despite his sharp teeth and dinosaur appearance, Rex is afraid of the dark, gets nervous easily, and just wants to be loved. His relationship with the other toys shows that true friendship accepts everyone for who they are, not how they look. Rex represents overcoming self-doubt, the difference between appearance and reality, and the idea that gentleness is a strength, not a weakness. His catchphrase 'I don't like confrontations!' captures his sweet, non-confrontational nature while highlighting his desire to be brave.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_rex",
    "background_image_1": "s0_rex",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 152,
    "url_id": "russell",
    "name": "Russell",
    "short_description": "An optimistic Wilderness Explorer scout who joins Carl on his adventure, teaching that friendship and perseverance can change lives.",
    "long_description": "Russell is an enthusiastic 8-year-old Wilderness Explorer scout who becomes Carl's unexpected companion on his journey to Paradise Falls. Despite Carl's initial grumpiness, Russell's optimism and determination help both of them discover the joy of adventure and friendship. Russell represents youthful enthusiasm, the importance of following through on commitments, and the idea that even small acts of kindness can have big impacts. His relationship with Carl shows how intergenerational friendships can heal old wounds and bring new purpose to life. Russell's journey teaches that helping others and staying true to one's beliefs can lead to the greatest adventures of all.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Up",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_russell",
    "background_image_1": "s0_russell",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 153,
    "url_id": "sadness",
    "name": "Sadness",
    "short_description": "The blue emotion who helps Riley process grief and loss, learning that sadness has an important role in emotional healing and connection.",
    "long_description": "Sadness is the blue emotion who appears gloomy and depressed, often feeling that she's not useful since people don't like feeling sad. However, Sadness plays a crucial role in helping Riley process grief, loss, and difficult emotions. Her journey through Riley's mind shows that sadness is necessary for emotional healing and building deeper connections with others. Sadness represents the complexity of emotions and the idea that even painful feelings serve important purposes. Her relationship with Joy demonstrates that all emotions work together to create a full emotional life, and that embracing sadness can lead to greater empathy and understanding.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Inside Out",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sadness",
    "background_image_1": "s0_sadness",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 154,
    "url_id": "sea_otters",
    "name": "Sea Otters",
    "short_description": "A family of playful sea otters who help Dory on her journey, representing the joy of family bonds and helping others in need.",
    "long_description": "The Sea Otters are a playful family who live in the Marine Life Institute and befriend Dory during her search for her family. With their enthusiastic personalities and love of fun, they help Dory navigate the institute and provide comic relief with their synchronized movements and chatter. Despite their small size, the otters show great courage and determination in helping their friend. They represent the importance of family bonds, the joy of helping others, and the idea that even brief encounters can create lasting friendships. Their relationship with Dory highlights themes of community support and the power of kindness in difficult times.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Dory",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sea_otters",
    "background_image_1": "s0_sea_otters",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 155,
    "url_id": "squirt",
    "name": "Squirt",
    "short_description": "A young sea turtle who dreams of riding the East Australian Current, representing youthful ambition and the spirit of adventure.",
    "long_description": "Squirt is a young sea turtle and son of Crush, who dreams of one day riding the powerful East Australian Current. With his enthusiastic personality and love of adventure, Squirt befriends Nemo and Marlin during their ocean journey. Despite his young age, Squirt shows wisdom beyond his years and helps the clownfish navigate the dangers of the ocean. He represents youthful ambition, the excitement of new experiences, and the importance of following one's dreams. Squirt's relationship with his father Crush shows the joy of family bonds and the passing down of knowledge from one generation to the next.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Finding Nemo",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "s0_squirt",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 156,
    "url_id": "sulley",
    "name": "Sulley",
    "short_description": "A large, furry monster who is the top scarer at Monsters, Inc., learning that laughter is more powerful than screams through his friendship with Boo.",
    "long_description": "James P. Sullivan, known as Sulley, is a large, furry blue monster who is the top scarer at Monsters, Inc. With his intimidating appearance and powerful roar, Sulley initially believes that scaring children is the key to success. However, his encounter with a human child named Boo teaches him that laughter is more powerful than screams and that not all humans are dangerous. Sulley's journey from focused career monster to caring friend shows personal growth and the importance of empathy. His relationship with Mike Wazowski demonstrates that true friendship transcends differences in size and personality. Sulley represents the idea that even the most intimidating exteriors can hide gentle hearts.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Monsters, Inc.",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sulley",
    "background_image_1": "s0_sulley",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 157,
    "url_id": "woody",
    "name": "Woody",
    "short_description": "A pull-string cowboy doll who is the leader of Andy's toys, learning that change and new friendships don't diminish the old ones.",
    "long_description": "Woody is a pull-string cowboy doll who has been Andy's favorite toy for years, serving as the leader of the toy community. With his sheriff badge, hat, and unwavering sense of loyalty, Woody initially struggles with jealousy when Buzz Lightyear becomes Andy's new favorite. His journey teaches him that leadership is about doing what's best for others, even when it hurts. Woody learns that true friendship endures through change and that there's room for both old and new friends. His catchphrase 'There's a snake in my boot!' captures his adventurous spirit. Woody represents loyalty, leadership, and the challenges of adapting to change while staying true to your values.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Toy Story",
    "category": "Pixar",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_woody",
    "background_image_1": "s0_woody",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 158,
    "url_id": "ahsoka_tano",
    "name": "Ahsoka Tano",
    "short_description": "The former Jedi Padawan of Anakin Skywalker who walks away from the Jedi Order, becoming a key figure in the rebellion against the Empire.",
    "long_description": "Ahsoka Tano is a Togruta female who was discovered on her homeworld of Shili and trained as a Jedi Padawan by Anakin Skywalker during the Clone Wars. Known for her strong connection to the Force and her distinctive white and blue facial markings, Ahsoka served bravely in the war but became disillusioned with the Jedi Order after being falsely accused of a crime. She left the Jedi and operated as a rogue agent during the rise of the Empire. Ahsoka became a key mentor figure in the rebellion, training new generations of Force users including Ezra Bridger and Sabine Wren. Her journey represents the search for truth beyond institutional dogma and the courage to forge one's own path. Ahsoka's wisdom, combat skills, and moral compass make her one of the most respected figures in the Star Wars saga.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Clone Wars",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_ahsoka_tano",
    "background_image_1": "s0_ahsoka_tano",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 159,
    "url_id": "bb_8",
    "name": "BB-8",
    "short_description": "The loyal astromech droid companion of Poe Dameron, known for his beeps, boops, and crucial role in helping the Resistance.",
    "long_description": "BB-8 is a spherical astromech droid with a domed head that can rotate 360 degrees, designed for starfighter maintenance and repair. Loyal to Resistance pilot Poe Dameron, BB-8 possesses a brave and resourceful personality, often going above and beyond his programming to help his friends. His distinctive orange and white coloring and expressive beeps and boops make him instantly recognizable. BB-8 played crucial roles in retrieving the map to Luke Skywalker and maintaining the Resistance's X-wing fighters. Despite being a droid, BB-8 displays clear emotions and forms deep bonds with organic beings. His courage, intelligence, and unwavering loyalty make him one of the most beloved droids in the Star Wars universe, proving that mechanical beings can have just as much heart as living creatures.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 160,
    "url_id": "boba_fett",
    "name": "Boba Fett",
    "short_description": "The legendary bounty hunter who pursues fugitives across the galaxy, known for his Mandalorian armor and unyielding determination.",
    "long_description": "Boba Fett is the most feared bounty hunter in the galaxy, clad in distinctive Mandalorian armor passed down from his father Jango Fett. Raised on Kamino among the clone troopers, Boba learned the arts of combat and tracking from a young age. His reputation for never failing a mission made him the go-to hunter for the Empire and various criminal organizations. Boba's jetpack, wrist-mounted weapons, and expert marksmanship make him a formidable opponent. Despite his ruthless reputation, Boba operates by a strict code of honor and professionalism. His complex relationship with the Empire and eventual alliance with Jabba the Hutt showcase his pragmatic approach to survival in a dangerous galaxy. Boba Fett represents the ultimate professional mercenary - efficient, deadly, and always one step ahead of his prey.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_boba_fett",
    "background_image_1": "s0_boba_fett",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 161,
    "url_id": "c_3po",
    "name": "C-3PO",
    "short_description": "The golden protocol droid fluent in over six million forms of communication, serving as translator and occasional comic relief.",
    "long_description": "C-3PO is a humanoid protocol droid with golden plating, designed to assist with etiquette, translation, and diplomatic functions. Built by Anakin Skywalker as a child, Threepio has served multiple masters throughout his long life, including Padmé Amidala, Luke Skywalker, and the Resistance. His extensive programming allows him to communicate in over six million forms of communication, making him invaluable for diplomatic missions and negotiations. Despite his proper and somewhat fussy personality, C-3PO often finds himself in dangerous situations alongside his astromech counterpart R2-D2. His catchphrase 'We're doomed!' reflects his tendency toward panic in stressful situations. Threepio's loyalty, extensive knowledge, and ability to adapt to new situations make him more than just a droid - he's a trusted companion who has witnessed some of the galaxy's most pivotal moments.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 162,
    "url_id": "captain_phasma",
    "name": "Captain Phasma",
    "short_description": "The commanding officer of the First Order's stormtroopers, known for her gleaming chrome armor and unyielding loyalty to the dark side.",
    "long_description": "Captain Phasma is the commanding officer of the First Order's stormtrooper legions, distinguished by her gleaming chrome armor that reflects her cold, unyielding personality. Recruited from a conquered world, Phasma rose through the ranks through sheer determination and combat prowess, becoming one of the most feared military leaders in the galaxy. Her armor, forged from the salvaged remains of a Resistance transport, symbolizes her transformation from victim to conqueror. Phasma's tactical brilliance and strict discipline make her an invaluable asset to General Hux and Supreme Leader Snoke. Despite her intimidating presence, Phasma operates with a code of honor among warriors, showing respect for worthy opponents. Her complex backstory and internal conflicts add depth to her role as a high-ranking villain in the First Order's hierarchy.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_captain_phasma",
    "background_image_1": "s0_captain_phasma",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 163,
    "url_id": "chewbacca",
    "name": "Chewbacca",
    "short_description": "The mighty Wookiee warrior and co-pilot of the Millennium Falcon, known for his strength, loyalty, and distinctive roars.",
    "long_description": "Chewbacca, or 'Chewie' as he's affectionately called by his friends, is a towering Wookiee warrior from the planet Kashyyyk. With his distinctive bandolier, bowcaster, and expressive roars that Han Solo can understand, Chewbacca is the epitome of loyalty and strength. Serving as co-pilot and best friend to Han Solo, Chewbacca has been through countless adventures aboard the Millennium Falcon. His Wookiee life debt to Han, formed when the smuggler saved his life, binds them in an unbreakable brotherhood. Despite his ferocious appearance and battle prowess, Chewbacca has a gentle heart, especially toward children and those he cares about. His roars and growls convey complex emotions and thoughts, making him one of the most expressive characters in the Star Wars universe. Chewbacca represents the power of true friendship and the idea that strength comes in many forms.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_chewbacca",
    "background_image_1": "s0_chewbacca",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 164,
    "url_id": "darth_vader",
    "name": "Darth Vader",
    "short_description": "The dark lord of the Sith, formerly Anakin Skywalker, whose fall to the dark side and eventual redemption define the Star Wars saga.",
    "long_description": "Darth Vader, born Anakin Skywalker, is one of the most iconic and tragic figures in the Star Wars universe. Once a promising Jedi Knight with unparalleled Force abilities, Anakin's fear of loss and manipulation by Emperor Palpatine led him to embrace the dark side. His transformation into the armored Sith Lord, sustained by life-support systems after devastating injuries, made him the Emperor's enforcer and the face of Imperial terror. Vader's deep, mechanical breathing and red lightsaber strikes fear into all who oppose him. However, beneath the dark armor lies the remnants of Anakin Skywalker, whose love for his children Luke and Leia becomes his path to redemption. Vader's story explores themes of power, corruption, redemption, and the eternal struggle between light and dark. His final sacrifice to save his son cements his place as a complex anti-hero rather than a simple villain.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_darth_vader",
    "background_image_1": "s0_darth_vader",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 165,
    "url_id": "ewoks",
    "name": "Ewoks",
    "short_description": "The furry, tribal inhabitants of Endor who use primitive weapons and cunning tactics to defeat the Empire despite their small stature.",
    "long_description": "The Ewoks are the indigenous inhabitants of the forest moon of Endor, small furry creatures with tribal culture and primitive technology. Despite their teddy bear-like appearance, Ewoks are fierce warriors who live in harmony with nature and possess surprising ingenuity. Their society revolves around tribal customs, spiritual beliefs, and communal living, with villages built high in the trees for protection. The Ewoks' encounter with the Rebel Alliance during the Battle of Endor proved pivotal, as their knowledge of the forest and clever tactics helped defeat the Imperial forces. Though initially wary of outsiders, the Ewoks' capacity for friendship and bravery demonstrates that size and technology don't determine worth. Their victory over the Empire shows that courage, cunning, and unity can overcome even the most powerful adversaries.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_ewoks",
    "background_image_1": "s0_ewoks",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 166,
    "url_id": "finn",
    "name": "Finn",
    "short_description": "The former stormtrooper who defects from the First Order, finding courage and purpose in the fight for freedom alongside Rey and Poe.",
    "long_description": "Finn, originally designated FN-2187, is a former First Order stormtrooper who makes the courageous decision to defect after witnessing the destruction of his village. Raised from birth to be a loyal soldier without a name or identity, Finn discovers his humanity when he refuses to participate in a massacre. His escape leads him to meet Rey and Poe Dameron, who give him his name and help him find his place in the galaxy. Despite his initial fear and lack of combat experience, Finn proves himself as a brave fighter and valuable member of the Resistance. His journey represents the power of choice, the discovery of personal identity, and the courage to stand against oppression. Finn's optimism, loyalty, and determination make him a symbol of hope and the possibility of redemption for those indoctrinated into evil systems.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_finn",
    "background_image_1": "s0_finn",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 167,
    "url_id": "han_solo",
    "name": "Han Solo",
    "short_description": "The charming smuggler and captain of the Millennium Falcon, whose wit, loyalty, and sharpshooting make him a legendary hero.",
    "long_description": "Han Solo is the roguish captain of the Millennium Falcon, known for his quick wit, expert piloting, and deadly accuracy with a blaster. Starting as a smuggler for Jabba the Hutt, Han becomes involved in the Rebel Alliance through his friendship with Luke Skywalker and Princess Leia. His relationship with Chewbacca, forged through a life debt, demonstrates the depth of his loyalty and capacity for true friendship. Han's charm and confidence often mask his insecurities and past traumas, but his willingness to risk everything for his friends reveals his heroic nature. The Millennium Falcon, which he claims to have won in a game of sabacc, becomes an extension of his personality - fast, reliable, and always ready for adventure. Han's journey from self-serving smuggler to selfless hero shows that redemption is possible for anyone willing to change.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_han_solo",
    "background_image_1": "s0_han_solo",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 168,
    "url_id": "jabba_the_hutt",
    "name": "Jabba the Hutt",
    "short_description": "The slimy crime lord who rules Tatooine's underworld, known for his greed, gluttony, and network of bounty hunters.",
    "long_description": "Jabba the Hutt is the obese, slug-like crime lord who rules the criminal underworld from his palace on Tatooine. As one of the most powerful gangsters in the Outer Rim, Jabba controls a vast network of bounty hunters, smugglers, and criminal enterprises. His grotesque appearance, with multiple chins, beady eyes, and constant drooling, matches his vile personality - greedy, sadistic, and utterly self-serving. Jabba's palace serves as both his home and throne room, where he conducts business while indulging in excessive eating and entertainment. Despite his repulsive nature, Jabba is a shrewd businessman who understands the value of fear and loyalty. His demise at the hands of Princess Leia, disguised as a bounty hunter, becomes one of the most iconic moments in Star Wars history. Jabba represents the corrupting influence of absolute power and unchecked greed in the galaxy.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_jabba_the_hutt",
    "background_image_1": "s0_jabba_the_hutt",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 169,
    "url_id": "kylo_ren",
    "name": "Kylo Ren",
    "short_description": "The conflicted dark side warrior, son of Han Solo and Leia Organa, whose internal struggle between light and dark defines his tragic journey.",
    "long_description": "Kylo Ren, born Ben Solo, is the son of Han Solo and Leia Organa, trained as a Jedi by his uncle Luke Skywalker. Torn between his family's legacy of light and the seductive power of the dark side, Ben embraces his grandfather's legacy as Darth Vader, renaming himself Kylo Ren. His distinctive crossguard lightsaber and masked appearance strike fear across the galaxy, but beneath the dark facade lies a deeply conflicted young man struggling with his identity. Kylo's relationship with Supreme Leader Snoke and his complex feelings toward his parents and uncle drive his actions. His internal battle represents the ongoing struggle between destiny and choice, nature and nurture. Despite his villainous acts, Kylo's moments of vulnerability and eventual redemption attempt show that even those who fall deeply into darkness can find their way back to the light.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_kylo_ren",
    "background_image_1": "s0_kylo_ren",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 170,
    "url_id": "luke_skywalker",
    "name": "Luke Skywalker",
    "short_description": "The farm boy who discovers his Jedi heritage and becomes a legendary hero, restoring balance to the Force through hope and perseverance.",
    "long_description": "Luke Skywalker is the young farm boy from Tatooine whose discovery of his Jedi heritage transforms him from an ordinary youth into one of the galaxy's greatest heroes. Raised by his aunt and uncle after his mother's death and father's fall to the dark side, Luke's simple life changes when he acquires R2-D2 and C-3PO. Trained by Obi-Wan Kenobi and Yoda, Luke learns to harness the Force while confronting his father's legacy as Darth Vader. His journey represents the classic hero's path - from call to adventure, through trials and mentors, to ultimate victory. Luke's optimism, determination, and belief in redemption define his character. Despite setbacks and losses, Luke never loses hope, inspiring others to believe in the power of good. His restoration of balance to the Force cements his place as a legendary figure whose influence extends far beyond his lifetime.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_luke_skywalker",
    "background_image_1": "s0_luke_skywalker",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 171,
    "url_id": "obi_wan_kenobi",
    "name": "Obi-Wan Kenobi",
    "short_description": "The wise Jedi Master who mentors Anakin Skywalker and Luke Skywalker, embodying the principles of the Jedi Order with grace and wisdom.",
    "long_description": "Obi-Wan Kenobi is the quintessential Jedi Master, known for his wisdom, calm demeanor, and unwavering commitment to the Jedi Code. As Qui-Gon Jinn's Padawan and later Anakin Skywalker's master, Obi-Wan represents the best of the Jedi Order - patient, disciplined, and deeply connected to the Force. His relationship with Anakin is complex, marked by mentorship, friendship, and ultimately tragedy when his apprentice falls to the dark side. In exile on Tatooine, Obi-Wan watches over young Luke Skywalker, becoming his first Jedi teacher. Obi-Wan's wisdom extends beyond combat skills to include profound insights about life, balance, and the nature of good and evil. His famous line 'The Force will be with you, always' captures his optimistic faith in the light side. Even in death, Obi-Wan continues to guide Luke as a Force ghost, demonstrating that true Jedi live on through their teachings and the lives they touch.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 172,
    "url_id": "poe_dameron",
    "name": "Poe Dameron",
    "short_description": "The skilled Resistance pilot and leader whose bravery, charm, and dedication to the cause inspire hope in the fight against the First Order.",
    "long_description": "Poe Dameron is the best pilot in the Resistance, known for his exceptional flying skills, quick wit, and unwavering dedication to the cause of freedom. As the son of Resistance veterans, Poe grew up in the shadow of the Empire's defeat, learning to fly from his mother Shara Bey. His black X-wing fighter with orange accents becomes iconic as he leads dangerous missions against the First Order. Poe's charm and confidence make him a natural leader, but his impulsiveness sometimes leads him into trouble. His partnership with BB-8 and friendship with Finn demonstrate his loyalty and capacity for deep connections. Despite losses and setbacks, Poe never loses his optimism or determination. He represents the next generation of heroes - skilled, brave, and committed to ensuring that the dark times of the Empire never return. Poe's leadership helps keep the spark of rebellion alive against overwhelming odds.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_poe_dameron",
    "background_image_1": "s0_poe_dameron",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 173,
    "url_id": "porgs",
    "name": "Porgs",
    "short_description": "The adorable, wide-eyed seabirds native to Ahch-To who befriend Luke Skywalker and provide comic relief with their curious antics.",
    "long_description": "Porgs are the charming, wide-eyed seabirds native to the island planet of Ahch-To, home to the first Jedi Temple. With their expressive faces, large eyes, and penguin-like bodies, Porgs quickly became fan favorites for their adorable appearance and curious behavior. These social creatures live in large colonies, communicating with chirps and displaying remarkable intelligence for animals. Their interactions with Luke Skywalker, from perching on his X-wing to curiously watching his training, add warmth and humor to his isolated existence. Despite their cute appearance, Porgs are resourceful survivors in Ahch-To's harsh environment. Their presence represents the beauty of simple, genuine connections and reminds viewers that even in times of great solitude and responsibility, moments of joy and companionship can be found in the most unexpected places.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Last Jedi",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_porgs",
    "background_image_1": "s0_porgs",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 174,
    "url_id": "princess_leia",
    "name": "Princess Leia",
    "short_description": "The strong-willed princess and rebel leader whose courage, intelligence, and royal bearing inspire the galaxy in the fight against tyranny.",
    "long_description": "Princess Leia Organa is the strong-willed daughter of Anakin Skywalker and Padmé Amidala, raised as a princess of Alderaan by Bail and Breha Organa. Her iconic cinnamon bun hairstyle and white robes symbolize her royal dignity and unyielding spirit. As a senator and later rebel leader, Leia demonstrates exceptional intelligence, diplomatic skills, and combat abilities. Her capture by Darth Vader and torture on the Death Star only strengthens her resolve. Leia's relationship with Han Solo adds romance and complexity to her character, while her twin brother Luke and role in the Rebellion showcase her leadership qualities. Despite personal losses, including the destruction of her home planet, Leia never wavers in her commitment to justice and freedom. She represents the perfect blend of grace and strength, showing that leadership requires both compassion and determination. Leia's legacy as a founding member of the New Republic cements her place as one of the galaxy's greatest heroes.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_princess_leia",
    "background_image_1": "s0_princess_leia",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 175,
    "url_id": "r2_d2",
    "name": "R2-D2",
    "short_description": "The resourceful astromech droid whose beeps, bravery, and technical expertise prove invaluable to the Rebel Alliance and Jedi alike.",
    "long_description": "R2-D2, or 'Artoo' as his friends call him, is a blue and white astromech droid known for his distinctive beeps, boops, and unwavering loyalty. With his dome head, retractable legs, and array of tools and interfaces, R2-D2 is a mechanical marvel capable of hacking systems, repairing starfighters, and storing vast amounts of data. His partnership with C-3PO provides comic relief, but R2-D2's bravery and resourcefulness have saved the day countless times. From carrying the Death Star plans to helping train Jedi, R2-D2 has been involved in some of the galaxy's most pivotal moments. Despite being a droid, R2-D2 displays clear personality and emotions through his beeps and actions. His loyalty to his friends and commitment to the greater good prove that mechanical beings can have just as much heart and courage as organic ones. R2-D2 represents the idea that true value comes from actions and loyalty, not programming or appearance.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "",
    "background_image_1": "",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 176,
    "url_id": "rey",
    "name": "Rey",
    "short_description": "The resilient scavenger who discovers her connection to the Force, becoming a powerful Jedi and symbol of hope for the galaxy's future.",
    "long_description": "Rey is a resilient scavenger from the desert planet of Jakku, surviving by salvaging parts from crashed starships in the harsh junkyard wilderness. Her simple life changes dramatically when she meets BB-8 and becomes entangled in the conflict between the Resistance and the First Order. Despite having no formal training, Rey discovers her strong connection to the Force and begins training as a Jedi. Her determination, resourcefulness, and natural talent make her a formidable warrior and Force user. Rey's journey explores themes of identity, belonging, and destiny. Orphaned as a child and abandoned on Jakku, Rey's search for her parents becomes a central part of her story. Her relationships with Finn, Poe, and Kylo Ren help her understand the complexities of light and dark. Rey represents the power of self-discovery and the idea that anyone, regardless of background, can become extraordinary through courage and perseverance.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Sequel Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_rey",
    "background_image_1": "s0_rey",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 177,
    "url_id": "sergeant_jyn_erso",
    "name": "Sergeant Jyn Erso",
    "short_description": "The determined rebel soldier whose mission to steal the Death Star plans becomes crucial in the fight against the Empire.",
    "long_description": "Sergeant Jyn Erso is a hardened rebel soldier whose life has been shaped by the Empire's destruction of her world and family. As the daughter of Galen Erso, the engineer forced to work on the Death Star, Jyn carries the weight of her father's sacrifice and the Empire's atrocities. Recruited by the Rebel Alliance for a desperate mission to steal the Death Star's technical schematics, Jyn leads a team of specialists through dangerous territory. Her determination and combat skills make her invaluable, but her distrust of authority and preference for independent action create tension with Alliance leadership. Jyn's journey represents the transformation from survivor to hero, learning to trust others and believe in a cause greater than herself. Despite the mission's high stakes and personal costs, Jyn's courage and moral compass inspire those around her. Her story emphasizes that even those scarred by war can find purpose and make a difference in the fight for freedom.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Rogue One",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_sergeant_jyn_erso",
    "background_image_1": "s0_sergeant_jyn_erso",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 178,
    "url_id": "stormtroopers",
    "name": "Stormtroopers",
    "short_description": "The elite soldiers of the Empire and First Order, clad in white armor and trained for unwavering loyalty to their commanders.",
    "long_description": "Stormtroopers are the elite shock troops of the Galactic Empire and later the First Order, recognizable by their stark white armor and imposing presence. Originally clones created from the template of Jango Fett, stormtroopers were designed to be the perfect soldiers - disciplined, obedient, and highly trained in combat. Their armor, with its distinctive helmets and black undersuits, strikes fear into enemies and symbolizes the Empire's might. Despite their reputation for precision and effectiveness, stormtroopers are often portrayed with surprising incompetence, highlighting the limitations of indoctrination and blind obedience. Individual stormtroopers like Finn show that beneath the armor are real people capable of conscience and change. The stormtroopers represent the dangers of authoritarian regimes that strip away individuality and replace it with unquestioning loyalty. Their evolution from clone army to conscripted soldiers reflects the Empire's growing desperation and moral decay.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_stormtroopers",
    "background_image_1": "s0_stormtroopers",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 179,
    "url_id": "the_child",
    "name": "The Child",
    "short_description": "The mysterious Force-sensitive infant whose adorable appearance belies powerful abilities and an important role in the galaxy's future.",
    "long_description": "The Child, affectionately known as 'Baby Yoda' or 'Grogu' by fans, is a mysterious Force-sensitive infant of Yoda's species. With his large eyes, expressive ears, and powerful connection to the Force, The Child displays abilities far beyond what his cute appearance suggests. Found by bounty hunters after Order 66, The Child forms a special bond with the Mandalorian Din Djarin, who becomes his protector. Despite his young age, The Child shows remarkable intelligence, using the Force to manipulate objects, heal wounds, and communicate telepathically. His journey represents innocence in a dangerous galaxy and the importance of found family. The Child's search for belonging and his connection to the ancient Jedi traditions highlight themes of legacy and hope for the future. Though he cannot speak, his actions and Force abilities make him one of the most powerful and enigmatic characters in the Star Wars universe.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "The Mandalorian",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_the_child",
    "background_image_1": "s0_the_child",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 180,
    "url_id": "yoda",
    "name": "Yoda",
    "short_description": "The ancient Jedi Master whose wisdom, mastery of the Force, and unique speech pattern have guided generations of Jedi through turbulent times.",
    "long_description": "Yoda is the ancient Jedi Master who has served as a wise counselor and powerful warrior for nearly 900 years. With his distinctive speech pattern ('Do or do not, there is no try'), green skin, pointed ears, and small stature, Yoda embodies the pinnacle of Jedi wisdom and Force mastery. As a member of the Jedi High Council, Yoda witnessed the rise and fall of the Republic, trained countless Jedi including Count Dooku and Luke Skywalker, and fought in the Clone Wars. His deep understanding of the Force and ability to see the future make him one of the most powerful beings in the galaxy. Despite his advanced age and small size, Yoda remains a formidable warrior and teacher. His wisdom extends beyond combat to include profound insights about life, balance, and the nature of good and evil. Yoda's journey from exile to becoming one with the Force represents the ultimate acceptance of change and the cyclical nature of life. Even as a Force ghost, Yoda continues to guide future generations, proving that true wisdom transcends physical form.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Original Trilogy",
    "category": "Star Wars",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_yoda",
    "background_image_1": "s0_yoda",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  },
  {
    "id": 3,
    "url_id": "angel",
    "name": "Angel",
    "short_description": "A charming and street-smart puppy who captures Scamp's heart in Lady and the Tramp II.",
    "long_description": "Angel is a feisty and independent puppy who once lived as a stray but dreams of finding a loving home. She meets Scamp, the rebellious son of Lady and Tramp, and helps him navigate the challenges of street life. Angel's past experiences make her wise beyond her years, and she ultimately helps Scamp realize the importance of family and belonging. Her character represents resilience, hope, and the desire for love and acceptance.",
    "character_creation_year": null,
    "first_appearance": "",
    "franchise": "Lady and the Tramp",
    "category": "Disney",
    "character_type": "",
    "species": "",
    "relationships": {},
    "voice_actors": [],
    "profile_image_1": "prf_angel",
    "background_image_1": "s0_angel",
    "created_at": "2025-10-27T00:00:00.000Z",
    "updated_at": "2025-10-27T00:00:00.000Z"
  }
]
